<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Nacho">
   <meta name="GENERATOR" content="Microsoft FrontPage 4.0">
   <title>Tema 1: Introducci&oacute;n a Java</title>
<link rel="stylesheet" href="apuntes.css" type="text/css">
</head>
<body>
<h1>Comentarios PLJ edici&oacute;n de julio de 2004</h1>
<p>Como parte de la evaluaci&oacute;n del curso no presencial hemos realizado 
  una serie de encuestas sobre distintos aspectos del curso. En una de las preguntas 
  de cada una de las encuestas se ped&iacute;a a los alumnos que hicieran una 
  evaluaci&oacute;n general del m&oacute;dulo o del curso. </p>
<p>El curso se componen de 3 m&oacute;dulos que requieren una dedicaci&oacute;n 
  de 15 horas cada uno. Cada m&oacute;dulo lo hemos dividido en 5 sesiones de 
  ejercicios de unas 3 horas de duraci&oacute;n. El contenido de los m&oacute;dulos 
  es:</p>
<ul>
  <li>M&oacute;dulo 1: Introducci&oacute;n a Java y a la Programaci&oacute;n Orientada 
    a Objetos</li>
  <li>M&oacute;dulo 2: Caracter&iacute;sticas b&aacute;sicas de Java (excepciones, 
    entrada/salida, hilos, ...)</li>
  <li>M&oacute;dulo 3: Interfaz de usuario y gr&aacute;ficos</li>
</ul>
<p>El curso ha sido seguido por 49 alumnos, todos ellos alumnos de distintos cursos 
  de las titulaciones de Inform&aacute;tica. Un 15% cursan primer curso, un 55% 
  segundo o tercer curso y un 30% segundo ciclo de Ingenier&iacute;a Inform&aacute;tica.</p>
<p>A continuaci&oacute;n reproducimos los comentarios que hemos recibido. </p>
<h2> Comentarios sobre el m&oacute;dulo 1 </h2>
<p><cite>&quot;El modulo 1 me ha parecido un poco lioso ya que es mi primera introduccion 
  a java y me he visto un poco apurado pero al final ha aprendido bastante.&quot;</cite></p>
<p><cite>&quot;Bien, aunque quizas le falte algo m&aacute;s de contenido.&quot;</cite></p>
<p><cite>&quot;Creo que cumple el objetivo de ser una inicializaci&oacute;n a 
  JAVA.&quot;</cite></p>
<p><cite>&quot;Muy pesado. Trabajo y no tengo mucho tiempo libre para dedicar 
  al curso. Por esta raz&oacute;n la carga de trabajo de alguno de los ejercicios 
  de este m&oacute;dulo ha llegado a saturar mi capacidad de trabajo, de hecho 
  no pude ni empezar la sesi&oacute;n 5 por falta de tiempo&quot;</cite></p>
<p><cite>&quot;Algunos ejercicios me resultaron un poco densos, y no estaba clara 
  la din&aacute;mica ( quiz&aacute;s porque sea el primer m&oacute;dulo, con el 
  m&oacute;dulo 2 voy mucho m&aacute;s suelto ).&quot;</cite></p>
<p><cite>&quot;Un m&oacute;dulo bastante adecuado para la introducci&oacute;n 
  al lenguaje Java. Me parece estupendo.&quot;</cite></p>
<p><cite>&quot;Bastante adecuado para tomar contacto con Java y algunas de sus 
  caracter&iacute;sticas. La inclusi&oacute;n de Eclipse en este m&oacute;dulo 
  me ha parecido una buena idea, para que el alumno conozca y aprenda a manejar 
  un entorno de desarrollo.&quot;</cite></p>
<p><cite>&quot;Me ha parecido bastante interesante con respecto a las herramientas 
  utilizadas, pero tal vez poco profundo en el contenido de las lecciones sobre 
  el lenguaje java. Veo que hay pocos ejemplos, ejemplos que se puedan probar, 
  ver curiosidades de las implementaciones, etc.&quot;</cite></p>
<p><cite>&quot;Aunque en algunos apartados teoricos los apuntes de teoria no explicaban 
  correctamente lo que despues se nos pedia en los ejercicios, la dificultad ha 
  sido aceptable y los ejercicios han resultado entretenidos.&quot;</cite></p>
<p><cite>&quot;Me ha parecido muy bueno, un poco largo. Ahora el modulo 2 es un 
  poco mas corto.&quot;</cite></p>
<p><cite>&quot;Me ha parecido bien planteado y con ejercicios muy interesantes 
  y entretenidos, como por ejemplo el de la sesi&oacute;n 5.&quot;</cite></p>
<p><cite>&quot;Para introducir, esta bastante bien, y te ense&ntilde;an tambien 
  bastante a hacer las cosas por ti mismo, y a buscar informacion&quot;</cite></p>
<p><cite>&quot;Bastante completo, y bien explicado&quot;</cite></p>
<p><cite>&quot;M'ha paregun un m&ograve;dul molt interessant, amb una introducci&oacute; 
  al llenguatge prou completa, que ofereix una visi&oacute; global de JAVA i introdueix 
  d'una manera r&agrave;pida a la sintaxi de JAVA&quot;</cite></p>
<p><cite>&quot;Con el modulo 1 se parte de una documentaci&oacute;n decente (alguna 
  carencia insignificante sobre clases abstractas e interfaces) pero para empezar 
  a programar Java desde cero o ampliar conocimientos me parece bien, en general. 
  Tambi&eacute;n destacar la ayuda del foro (en caso de duda). Con el m&oacute;dulo 
  uno se practica todo el temario objetivo con el planning propuesto al inicio 
  del curso.&quot;</cite></p>
<p><cite>&quot;Me ha parecido correcto y ameno. He aprendido bastante con dicho 
  m&oacute;dulo.&quot;</cite></p>
<p><cite>&quot;Bien, pero creo que la dificultad ha sido muy baja.&quot;</cite></p>
<p><cite>&quot;Me ha parecido muy interesante, pero no hubiera estado mal recibir 
  los apuntes impresos, no el html.&quot;</cite></p>
<p><cite>&quot;La verdad es que como iniciaci&oacute;n al lenguaje para las personas 
  que no teniamos ni idea como yo est&aacute; muy bien. Desde mi punto de vista 
  cumple su misi&oacute;n de iniciar al alumno en el lenguaje.&quot;</cite></p>
<p><cite>&quot;Bastante interesante, me ha permitido empezar a conocer el lenguaje 
  de una manera comoda y sencilla.&quot;</cite></p>
<p><cite>&quot;Bastante entretenido. Las sesiones 1,2 y 5 son bastante adsequibles 
  de realizar y entender. Respecto a las sesiones 3 y 4 (bajo mi punto de vista 
  y experiencia con este modulo 1) son mas o menos complejas y llevan mas horas 
  de trabajo que las estimadas (5 horas mas o menos). Tambi&eacute;n tengo que 
  decir que este m&oacute;dulo lo he realizado entre el s&aacute;bado y domingo, 
  ya que estuve esa semana de viaje haciendo otro curso de libre elecci&oacute;n 
  en Cocentaina. Resumiendo, entretenido y pr&aacute;ctico con la salvedad de 
  la complejidad de las sesiones 3 y 4.&quot;</cite></p>
<p><cite>&quot;Se quiere abarcar demasiado en tan poco tiempo.&quot;</cite></p>
<p><cite>&quot;Fundamental para comprender conceptos basicos de Java, tales como 
  la instalacion del SDK y comprender las variables de entorno con las que trabaja 
  Java.<br>
  Sin embargo, me parece que se ha hecho una valoracion optimista en cuanto al 
  tienpo que necesitan las sesiones para su realizacion, sobre todo las sesiones 
  3 y 4 se me han hecho largas y pesadas de hacer.&quot;</cite></p>
<p><cite>&quot;Bastante util ya que se han practicado practicamente todos los 
  aspectos que se tratan en el tema 1 del curso.&quot;</cite></p>
<p><cite>&quot;Interesante, de nivel adecuado. Aunque la &uacute;ltima sesi&oacute;n 
  se sal&iacute;a bastante m&aacute;s que las cuatro anteriores.&quot;</cite></p>
<p><cite>&quot;Costoso y que necesita mucha dedicacion.&quot;</cite></p>
<p><cite>&quot;Me ha parecido un poco dificil ya que no sabia nada de programacion 
  en Java. Aun as&iacute; bastantes cosas se asemejan a la programacion en C++ 
  y por ahi se pueden subsanar algunas dudas.&quot;</cite></p>
<p><cite>&quot;Interesante, aunque a veces no est&aacute; claro lo que se est&aacute; 
  preguntando en las cuestiones.&quot;</cite></p>
<p><cite>&quot;Me ha parecido f&aacute;cil en general pero tedioso de realizar.&quot;</cite></p>
<p><cite>&quot;Esta muy bien, pero no me hubiera importado que el curso fuera 
  presencial porque &iquest;con que motivaci&oacute;n voy a ponerme a hacer estos 
  ejercicios en pleno verano?&quot;</cite></p>
<p><cite>&quot;Una manera genial de iniciarse en Java. Muy bien hecho.&quot;</cite></p>
<p><cite>&quot;Creo que ha sido bastante &uacute;til, y est&aacute; bien porque 
  es una forma amena de inicializarse con el lenguaje. Lo que me ha gustado bastante 
  es el detalle de incorporar el programa Eclipse en el cd, ya que creo que es 
  bastante bueno y comodo a la hora de utilizarlo.&quot;</cite></p>
<p><cite>&quot;Me ha aparecido un modulo inicial muy interesante y practico&quot;</cite></p>
<p><cite>&quot;Una toma de cotacto bastante suave para un lenguaje con tantas 
  particularidades como Java, habr&iacute;a que comentar algo m&aacute;s sobre 
  las posibilidades que ofrece la jerarquia de clases est&aacute;ndar.&quot;</cite></p>
<p><cite>&quot;Me ha parecido que ha sido el mas laborioso de hacer , quizas debido 
  a que ha sido la primera toma de contacto con java y con el eclipse , al menos 
  para mi y por eso me ha costado mas hasta que he entendido como iba el eclipse 
  y como se trabajaba con java.&quot;</cite></p>
<p><cite>&quot;Teniendo que es mi primer curso de este tipo, adecuado al contenido 
  y al tiempo disponible&quot;</cite></p>
<h2>Comentarios sobre el m&oacute;dulo 2</h2>
<p><cite>&quot;Al basarse los ejercicios en copiar trozos de codigo ya hechos 
  y intentar entenderlos me han parecido muy rapidos y muy faciles de hacer, pero 
  no muy aptos para aprender todos los conceptos. Se deberia tender mas a obligar 
  al alumno a crear su propio codigo.&quot;</cite></p>
<p><cite>&quot;Mucho m&aacute;s entretenido que el m&oacute;dulo 1, creo que la 
  din&aacute;mica es bastante m&aacute;s acertada. El estilo &quot;lee el apartado 
  X antes de seguir&quot; y con ejercicios dirigidos paso a paso, las cosas quedan 
  muy claras.&quot;</cite></p>
<p><cite>&quot;M&aacute;s pr&aacute;ctico y dirigido que el m&oacute;dulo 1&quot;</cite></p>
<p><cite>&quot;Algo demasiado facil&quot;</cite></p>
<p><cite>&quot;Este m&oacute;dulo me ha parecido demasiado f&aacute;cil, en el 
  sentido de que todo estaba hecho. No habia que inventar nada, ni experimentar. 
  Me ha parecido bastante flojo y muy corto. Creo que los temas que se han dado 
  tienen materia suficiente como para hacer m&aacute;s ejemplos, o si se dan pr&aacute;cticamente 
  hechos, como es el caso, ver m&aacute;s casos de uso.&quot;</cite></p>
<p><cite>&quot;Bastente &uacute;til, ya que los conceptos planteados son de gran 
  utilidad&quot;</cite></p>
<p><cite>&quot;Ha estado muy bien. Este m&oacute;dulo ha estado muy entretenido. 
  Adem&aacute;s, ha sido mas llevadero que el m&oacute;dulo 1, en el sentido de 
  que ha sido menos complejo de realizar.Tambi&eacute;n presentaba mas ayuda. 
  Es decir, para hacer los diferentes programas, venian muy explicados paso a 
  paso y no eran dif&iacute;ciles de realizar.&quot;</cite></p>
<p><cite>&quot;Este m&oacute;dulo me ha parecido m&aacute;s interesante que el 
  anterior, y creo que es bastante &uacute;til.&quot;</cite></p>
<p><cite>&quot;El curso ya se va haciendo mas entretenido y da mas satisfacci&oacute;n 
  ir viendo como evolucionamos.&quot;</cite></p>
<p><cite>&quot;El modulo 2, me ha parecido mas entretenido que el primero, pero 
  la dificultad un poco menor.&quot;</cite></p>
<p><cite>&quot;Bien, lo que me pasa es que muchas veces respondes a las preguntas 
  lo que tu crees, pero luego no es asi, y tampoco sabes a ciencia cierta si has 
  contestado bien. creo q seria de utilidad q al final nos proporcionaran las 
  respuestas a las preguntas&quot;</cite></p>
<p><cite>&quot;M'ha paregut molt interessant, per&ograve; crec que es va molt 
  r&agrave;pid, i la gesti&oacute; tant de les excepcions com dels fils crec que 
  s'hauria de profunditzar una miqueta m&eacute;s.&quot;</cite></p>
<p><cite>&quot;Lo que mas complicado me ha parecido ha sido el mini-proyecto de 
  la ultima sesion del bloque, ya que algunas cosas no me funcionaban por mas 
  que lo intentaba.&quot;</cite></p>
<p><cite>&quot;M&aacute;s interesante y entretenido que el modulo uno.&quot;</cite></p>
<p><cite>&quot;En el m&oacute;dulo 2 se estudian bastantes cosas interesantes: 
  excepciones, hilos, lectura/escritura de ficheros (y flujos de datos). La &uacute;nica 
  pega que no se estudien los Sockets (aunque realmente sea parecido a como se 
  har&iacute;a con ficheros). Por lo demas est&aacute; bastante bien&quot;</cite></p>
<p><cite>&quot;Una buena introducci&oacute;n a las posdibilidades de javas&quot;</cite></p>
<p><cite>&quot;Mas escueto y menos participativo que el primero.&quot;</cite></p>
<p><cite>&quot;ok&quot;</cite></p>
<p><cite>&quot;Creo que se quiere abarcar mucho en poco tiempo, la &uacute;ltima 
  sesi&oacute;n o proyecto no esta muy clara y presupone cosas que no se, hecho 
  de menos comentarios en el c&oacute;digo de programa.&quot;</cite></p>
<p><cite>&quot;Las primeras sesiones se ven r&aacute;pidamente los conceptos que 
  despues tenemos que aplicar a la ultima sesion del modulo, al hacer el modulo 
  10 muchas cosas no sabes realmente como van, ya que son muchos conceptos que 
  casi no tenemos tiempo para asimilar, pero en general bien.&quot;</cite></p>
<p><cite>&quot;La ultima sesion me costo muchisimo me atasque en un error y no 
  supe salir en tres horas, y al final en la correccion me ha dado error alli&quot;</cite></p>
<p><cite>&quot;Me ha parecido muy interesante e interactivo&quot;</cite></p>
<p><cite>&quot;La verdad es que el nivel de dificultad respecto al anterior a 
  disminuido considerablemente, por una parte es bueno, pero por otra implica 
  a una pr&aacute;ctica del &quot;copy-paste&quot; un tanto peligrosa ;) . Por 
  lo dem&aacute;s me gusta el curso, aunque entiendo que por cuesti&oacute;n de 
  tiempo no se pueda profundizar mucho en determinados apartados.&quot;</cite></p>
<p><cite>&quot;Completo&quot;</cite></p>
<p><cite>&quot;Bastante interesante, aunque creo que la parte de los hilos se 
  ha visto muy por encima y no ha quedado lo bastante clara. Con lo visto en el 
  curso da la sesaci&oacute;n de que los hilos son complicados y no tienen utilidad.&quot;</cite></p>
<p><cite>&quot;Me aparecido un modulo bastante impoprtante e interesante&quot;</cite></p>
<p><cite>&quot;Est&aacute; muy bien hecho, tanto o m&aacute;s que el m&oacute;dulo1. 
  Se aprende de manera muy pr&aacute;ctica y amena cosas que podr&iacute;an ser 
  muy pesadas.&quot;</cite></p>
<p><cite>&quot;Habr&iacute;a que resaltar la importancia de la concurrencia, y 
  la gesti&oacute;n multihilo en la programaci&oacute;n, cada vez son m&aacute;s 
  las aplicaciones que exigen de multiples hilos de ejecuci&oacute;n, y supongo 
  que har&iacute;an falta m&aacute;s horas de practica sobre conceptos m&aacute;s 
  avanzados sobre el tema.&quot;</cite></p>
<p><cite>&quot;Muy bien, en mi opinion falta un poco mas de uso de los metodos 
  aprendidos por nosotros mismos sin hacer tanto copia y pega de los apuntes.&quot;</cite></p>
<p><cite>&quot;Mucho m&aacute;s corto que el primero. Con conceptos interesantes 
  pero que no se han tratado en profundidad en los ejercicios. Muchas partes de 
  los ejercicios ven&iacute;an ya hechas y s&oacute;lo hab&iacute;a que copiarlas; 
  quiz&aacute; hubiera sido mejor tener menos ejercicios y realizarlos enteros 
  desde el principio.&quot;</cite></p>
<p><cite>&quot;Me ha parecido interesante sobre todo la parte de Hilos, me hubiera 
  gustado que hubieran profundizado mas en el tema.&quot;</cite></p>
<p><cite>&quot;Me ha parecido bien planteado y con ejercicios que dejan muy clara 
  la utilidad de las excepciones, hilos, etc.&quot;</cite></p>
<p><cite>&quot;Bien, interesante pero algo b&aacute;sico.&quot;</cite></p>
<p><cite>&quot;Me ha parecido de los mas interesantes de hacer , y de los mas 
  utiles quizas de cara al futuro, pero me ha parecido que se ha visto demasiado 
  rapido , tambien es cierto que no hay tiempo para mas , pero se deberia de haber 
  machado un poco mas esta parte.&quot;</cite></p>
<p><cite>&quot;En este m&oacute;dulo nos hemos metido mas en el cotarro de java, 
  me ha parecido muy interesante y muy productivo, ya que en este m&oacute;dulo 
  si que nos hemos tenido que pelear con los ejercicios y deducir muchas cosas, 
  las sesiones han sido de mucho aprendizaje y me han parecido muy provechosas.&quot;</cite></p>
<p><cite>&quot;Mas orientado a la practica que el modulo 1, con pocas preguntas, 
  pero que hacian mas incapie en partes importantes que se habian visto. Me ha 
  gustado mas que el modulo 1.&quot;</cite></p>
<h2>Comentarios sobre el m&oacute;dulo 3</h2>
<p><cite>&quot;Bien, supongo que cuando mas practique mejor, pero para una base 
  esta bien&quot;</cite></p>
<p><cite>&quot;Ha sido el m&aacute;s entretenido.&quot;</cite></p>
<p><cite>&quot;Ha sido un m&oacute;dulo entretenido pero un poco dif&iacute;cil 
  de entender algunos conceptos. En lo que respecta a la forma de trabajar y la 
  dificultad de los ejercicios ha sido muy similar a la del m&oacute;dulo 2. Como 
  digo, entretenido y no se me ha hecho nada pesado.&quot;</cite></p>
<p><cite>&quot;Bastante similar al modulo 2 en cuanto a tipo de ejercicios menos 
  el ultimo que ya dejaba algo de margen a la creatividad.&quot;</cite></p>
<p><cite>&quot;El m&aacute;s entretenido.Quiz&aacute; poco tiempo para asentar 
  tantos conceptos.&quot;</cite></p>
<p><cite>&quot;Muy bien, pero como en la sesion anterior hay mucha cortar y pegar 
  codigo y deberias de poner algunos ejercicios para que podamos coger un poco 
  de soltura al usar los metodos aprendidos.&quot;</cite></p>
<p><cite>&quot;Bastante util ya que ha servido como toma de contacto con el desarrollo 
  de aplicaiones graficas&quot;</cite></p>
<p><cite>&quot;Interesante, hacer el proyecto del juego me ha gustado mucho.&quot;</cite></p>
<p><cite>&quot;Bastante entretenido, sobre todo la oportunidad de iniciarse en 
  la programacion de juegos, me ha parecido un modulo entretenido, y muy util 
  para aumentar la calidad de los programas, dotandolos de interfaz gr&aacute;fica, 
  que con java es de las mas sencillas de aprender que conozco.&quot;</cite></p>
<p><cite>&quot;El m&oacute;dulo tres ES EL M&Aacute;S ATRACTIVO. Sobretodo para 
  quienes no hab&iacute;amos tenido experiencia previa con GUIs &oacute; gr&aacute;ficos. 
  Me encant&oacute;, me gustaron los ejercicios y atesoro la carpeta con todo 
  el material de &eacute;ste m&oacute;dulo. Hubiese sido interesante hacer algo 
  m&aacute;s complicado, aunque aun as&iacute;, las opciones eran muy amplias 
  y he aprendido mucho.<br>
  Saludos.&quot;</cite></p>
<p><cite>&quot;Un modulo muy interesante y muy importante por todo lo que se ve, 
  pero tambien me parece que se aprende lo que uno esta dispuesto a aprender y 
  quiere dedicarle porque lso ejercicios estan practicamente resueltos sin tener 
  que pensar mucho sobre como se deberia programar cada ejercicio que se pide, 
  quizas seria mejor pedir ejercicios menos laboriosos pero en los que con menos 
  ayuda el estudiante trabaje sobre ellos mas.Pero creo que todo lo visto esta 
  genial y muy interesante.&quot;</cite></p>
<p><cite>&quot;Ha estat un m&ograve;dul prou interessant.&quot;</cite></p>
<p><cite>&quot;En la sesi&oacute;n &uacute;ltima he dedicado m&aacute;s tiempo 
  de lo normal pero por hacer la parte optativa completa. Por lo dem&aacute;s 
  la ultima sesion me ha perecido muy practica (sobre todo la &uacute;ltima sesion). 
  El resto de sesiones muy copy paste.&quot;</cite></p>
<p><cite>&quot;Muy interesante no conoc&iacute;a nada de lo que se trata en el 
  m&oacute;dulo.&quot;</cite></p>
<p><cite>&quot;Bien,el juego muy entretenido&quot;</cite></p>
<p><cite>&quot;Me ha gustado sobre todo el proyecto, era lo mas dificil, pero 
  tambien era lo mas entretenido de realizar.&quot;</cite></p>
<p><cite>&quot;Al igual que los anteriores me ha gustado porque me ha ense&ntilde;ado 
  capacidades de JAVA que no conocia.&quot;</cite></p>
<p><cite>&quot;Muy y digo MUY instructivo, gracias&quot;</cite></p>
<p><cite>&quot;La parte m&aacute;s practica del curso, pero es evidente que las 
  otras eran necesarias para poder abordar esta.&quot;</cite></p>
<p><cite>&quot;Completo pero muy r&aacute;pido&quot;</cite></p>
<p><cite>&quot;Una maravilla, muy interesante y ameno&quot;</cite></p>
<p><cite>&quot;Me ha parecido el m&aacute;s interesante y &uacute;til de los 3 
  m&oacute;dulos, porque hasta ahora no habia realizado aplicaciones gr&aacute;ficas.&quot;</cite></p>
<p><cite>&quot;El m&oacute;dulo 3 me ha parecido un poco escueto. No se profundiza 
  mucho en la realizaci&oacute;n de aplicaciones gr&aacute;ficas. Adem&aacute;s 
  creo que un punto que resultar&iacute;a interesante en este m&oacute;dulo es 
  la realizaci&oacute;n de algunos ejemplos MVC como el visto en un m&oacute;dulo 
  anterior, pero con interfaz gr&aacute;fica.&quot;</cite></p>
<p><cite>&quot;El m&aacute;s interesante y entretenido de los 3 m&oacute;dulos.&quot;</cite></p>
<p><cite>&quot;Ha estado muy bien sobretodo a la hora de saber como hacer un juego&quot;</cite></p>
<p><cite>&quot;El mas entretenido de todos. En los ejercicios nos van guiando 
  paso a paso, explicando como y por que hacer las cosas de una determinada manera, 
  quedando bastante claros los conceptos que se quieren explicar.&quot;</cite></p>
<p><cite>&quot;EL mas entretenido de todos &quot;</cite></p>
<h2>Comentarios sobre todo el curso en conjunto</h2>
<p><cite>&quot;Bien, lo que pasa es que con el sistema este crees que haces las 
  cosas bien y luego resulta q no, o que hay formas mejor de hacerlo, y uno por 
  si solo es dificil darse cuenta de esos detalles. Pero no es un problema del 
  curso, en grandes lineas esta muy bien.&quot; </cite></p>
<p><cite>&quot;Demasiado b&aacute;sico. Creo que no es muy acertado en los ejercicios 
  darlo casi todo hecho pues hay varios de los ejercicios que se pueden realizar 
  sin siquiera mirar los apuntes, copiando y pegando. Ser&iacute;a mucho mejor 
  un curso presencial.&quot;</cite></p>
<p><cite>&quot;El curso, en general ha estado muy entretenido y me ha servido 
  para entender muchos conceptos de Java que no ten&iacute;a nada claros, ya que 
  nunca me lo hab&iacute;an explicado. Es decir, he programado en Java pero hab&iacute;an 
  muchas cosas que no entend&iacute;a. El m&oacute;dulo 1 ha sido el m&aacute;s 
  dificil de hacer, ya que hab&iacute;a que hacer mas cosas por cuenta de uno 
  mismo. Los m&oacute;dulos 2 y 3 han sido mas adsequibles ya que el c&oacute;digo 
  a implementar ven&iacute;a casi todo hecho y se iba programando poco a poco, 
  para entender todos los conceptos e ir viendo la estructura que hay que seguir. 
  Bueno, en general todo muy bien. Muchas gracias por todo.&quot;</cite></p>
<p><cite>&quot;Aunque el primer bloque del curso contenia ejercicios entretenidos 
  e interesantes de hacer, los otros dos han recortado demasiado el apartado creativo 
  a la hora de resolverlos.&quot;</cite></p>
<p><cite>&quot;Una buena introducci&oacute;n para la programaci&oacute;n en lenguaje 
  JAVA. Pero al concentrarse en 3 semanas las cosas no quedan tan claras como 
  me gustar&iacute;a, siendo labor del alumno el seguir practicando para finalmente 
  controlar este lenguaje. Pues eso, como introducci&oacute;n muy bien.&quot;</cite></p>
<p><cite>&quot;Muy bueno. Le falta algo mas de profundidad pero como teneis la 
  limitacion de las horas, yo creo que no se puede hacer mucho m&aacute;s.&quot;</cite></p>
<p><cite>&quot;Util ya que constituye una buena introduccion al lenguje java&quot;</cite></p>
<p><cite>&quot;El curso me ha parecido interesante, me ha ayudado a rellenar unas 
  lagunas de java que no sabia que tenia. Me ha parecido mal que no nos enviaran 
  el temario impreso y que practicamente nos dieran el codigo hecho, si no te 
  lo curras tu mismo no aprendes tanto, aunque en un curso de verano que te lo 
  den todo mascado es mejor.&quot;</cite></p>
<p><cite>&quot;Me pareci&oacute; muy interesante. Honestamente, lo primero que 
  me atrajo fueron los cr&eacute;ditos porque yo no creia que Java pudiese ser 
  tan &quot;potente&quot;. Me he sorprendido y he aprendido much&iacute;simo. 
  La din&aacute;mica del curso me parece ideal, porque es llevadera para quienes 
  no est&aacute;n muy interesados y muy presta a investigar para quienes realmente 
  ten&iacute;amos intenciones de aprender. El Curso es muy bueno.&quot;</cite></p>
<p><cite>&quot;Me ha parecido un curso bueno en generla y en el que al menos yo 
  he aprendido bastante ya que no sabia nada de java, me imagino que el que ya 
  sabia algo habra incrementado tb sus conocimientos.&quot;</cite></p>
<p><cite>&quot;Muy bien en conjunto, aunque me hubiese gustado algunas nociones 
  de programacion de sockets, para hacer aplicaciones distribuidas, algo de RMI. 
  As&iacute; como algunas cosas interesantes que se pueden encontrar en los paquetes 
  javax.*; de todas formas me pareci&oacute; un curso ameno, f&aacute;cil de seguir, 
  con abundante documentaci&oacute;n de referencia, y muy &uacute;til para mejorar 
  la calidad de los programas desarrollados, al menos en mi caso&quot;</cite></p>
<p><cite>&quot;Un molt bon curs introductori per al llenguatge JAVA, on es presenten 
  d'una manera senzilla exemples de tot tipus de programes en JAVA.&quot;</cite></p>
<p><cite>&quot;El curso est&aacute; bien. En el modulo 2 y 3 abundo bastante el 
  copy-paste. Solo las &uacute;ltimas sesiones de ambos m&oacute;dulos implican 
  creatividad. Se ha hechado en falta un material escrito de los apuntes para 
  las lecturas (no estar&iacute;a mal para cursos posteriores o incluso este, 
  aunque ya es tarde supongo). Por lo dem&aacute;s est&aacute; bastante bien.&quot;</cite></p>
<p><cite>&quot;Me ha parecido bueno puesto que es bastante din&aacute;mico, he 
  aprendido aspectos de Java que no conoc&iacute;a y ha sido c&oacute;modo realizarlo 
  desde casa.&quot;</cite></p>
<p><cite>&quot;El curso lo cogemos con mucho interes pero lo que pasa es que algunos 
  ejercicios son muy te&oacute;ricos, pero en general entretenido e interesante.&quot;</cite></p>
<p><cite>&quot;Al principio fue un poco duro adaptarse a este lenguaje nuevo para 
  mi. Pero conforme realizaba las sesiones, todo parecia mas intuitivo y ameno. 
  Lo mejor de todo el curso ha sido la ultima sesion, en la cual desarrolle el 
  juego del oso Yogi. Me ha gustado esta experiencia realizando dicho juego.&quot;</cite></p>
<p><cite>&quot;La verdad es que como iniciaci&oacute;n al lenguaje ha estado bastante 
  bien, porque nos ha dado ha conocer algunas de las propiedades m&aacute;s importantes 
  que posee JAVA as&iacute; como su modo de utilizarlas.&quot;</cite></p>
<p><cite>&quot;Me ha parecido muy instructivo. He de decir que ha sido mi primera 
  experncia en programacion orientada a objetos y lo habis hecho realmente bien. 
  Gracias a vosotros creo que pasare muy bien en POO el proximo curso. En cuanto 
  a los apuntes tal vez deberias en algunos puntos, como en los hilos, remitir 
  a alguna parte dle aPI o explayaros algo mas. Bueno, es mi punto de vista, pero 
  he dedeciros que en gneral a sido una experiencia cuanto mnos explendida.&quot;</cite></p>
<p><cite>&quot;Me ha parecido muy interesante. No profundiza mucho pero es suficiente 
  como para tener alg&uacute;n conocimiento de java.&quot;</cite></p>
<p><cite>&quot;Me ha parecido un curso muy completo, el hecho de ser no presencial 
  me ha gustado y es facil aprender bastante con una poca de iniciativa. Me parece 
  mas completo y mejor evaluado el primer m&oacute;dulo que el resto. Muy buen 
  curso.&quot;</cite></p>
<p><cite>&quot;Me ha parecido un curso muy bien gestionado para ser on-line y 
  con unos materiales muy bien preparados.<br>
  Saludos. Enhorabuena&quot;</cite></p>
<p><cite>&quot;Creo que ha sido bastante interesante. Me ha proporcionado unos 
  conocimientos sobre Java que me serviran para posteriores aplicaciones. El hecho 
  de que sea no presencial da un poco m&aacute;s de libertad a la hora de realizar 
  las sesiones, pero me parece un buen m&eacute;todo. Toda la informaci&oacute;n 
  (apuntes, web, foro, ...) ha sido muy &uacute;til para la realizaci&oacute;n 
  del curso.&quot;</cite></p>
<p><cite>&quot;Me parece un curso interesante, aunque creo que al tener algo de 
  experiencia en la programaci&oacute;n con Java me ha resultado muy sencillo, 
  tal vez se profundiza poco en el lenguaje. Pero tambi&eacute;n creo que dirigido 
  a personas con pocos conocimientos de Java est&aacute; bastante bien planteado. 
  Creo que se deber&iacute;a utilizar alg&uacute;n que otro paquete m&aacute;s 
  del API para ir conociendola y saber d&oacute;nde y qu&eacute; buscar cuando 
  necesitas algo.&quot;</cite></p>
<p><cite>&quot;Muy interesante, he aprendido cosas nuevas sobre Java, y es un 
  curso que recomendar&eacute; a mis conocidos. EL hecho de que sea no presencial 
  me ha venido muy bien, aunque creo que puede perjudicar a auquellas personas 
  que sepan poco o nada sobre Java.&quot;</cite></p>
<p><cite>&quot;Me ha parecido muy interesante, especialmente las ultimas sesiones 
  en las que se explicaba el modo gr&aacute;fico, y la &uacute;ltima sesi&oacute;n, 
  con la posibilidad de realizar un juego. El planteamiento me ha parecido muy 
  bueno, puesto que es mucho m&aacute;s sencillo entenderlo todo mediante ejercicios 
  y ejemplos, que &uacute;nicamente limit&aacute;ndonos a leer los apuntes. Resumiendo: 
  un curso muy recomendable.&quot;</cite></p>
<p><cite>&quot;Esta bastante bien, pero necesita mucha dedicacion y hay cosas 
  que no se quedan bien.&quot;</cite></p>
<p><cite>&quot;Me aparecido un curso facil y muy completo, ademas de entretenido. 
  LAs explicaciones, apuntes y consultas a los profesores en el foro han sido 
  correctas remarcando especialmente la ayuda de los profesores que me ha parecuido 
  esencial cuya contestacion era rapida.&quot;</cite></p>
<h2>Valoraci&oacute;n general del curso (de 1 a 5)</h2>
<p><img src="imagenes/valoracion.png" width="331" height="216"></p>
</body>
</html>