<!DOCTYPE html PUBLIC "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
  <meta name="Author" content="Nacho">
  <meta name="GENERATOR" content="Microsoft FrontPage 4.0">
  <title>Normas PLJ</title>
  <link rel="stylesheet" href="apuntes.css" type="text/css">
</head>
<body>
<h1>Normas de funcionamiento del Curso de Programaci&oacute;n en Lenguaje Java</h1>
<h2> Curso impartido del 5 al 30 de julio de 2004 y aprobado en la comisi&oacute;n 
  CECLEC del 11 de mayo de 2004</h2>
<p>1. El curso comenzar&aacute; el pr&oacute;ximo lunes 5 de julio.</p>
<p>2. Durante la semana del 28 de junio enviaremos por correo (Paquete Express) 
  un CD-ROM con el software necesario para realizar el curso y con los apuntes 
  del mismo. Tambi&eacute;n enviaremos por e-mail el c&oacute;digo de acceso a 
  la web del curso (http://www.jtech.ua.es/plj)</p>
<p>3. El curso consta de 3 m&oacute;dulos, a realizar en las semanas del 5, 12 
  y 17 de julio.</p>
<p>4. Al comienzo de cada m&oacute;dulo se pondr&aacute;n en la web del curso 
  los ejercicios de esa semana (5 sesiones de unas 3 horas), que deber&aacute;n 
  entregarse todos juntos como muy tarde el domingo de cada semana (11, 18 y 25 
  de julio).</p>
<p>5. Se podr&aacute;n consultar dudas sobre los ejercicios a los profesores del 
  curso usando el foro que se abrir&aacute; a tal efecto en la web del curso.</p>
<p>6. Al comienzo de la semana siguiente a la entrega de los ejercicios (los d&iacute;as 
  14, 21 y 27 de julio) el profesor responsable del m&oacute;dulo enviar&aacute; 
  el resultado de la correcci&oacute;n, indicado (en su caso) aquellos ejercicios 
  que deber&aacute;n corregirse.</p>
<p>7. Hasta el d&iacute;a 29 de julio se podr&aacute;n enviar los ejercicios corregidos. 
  El d&iacute;a 31 de julio enviaremos la calificaci&oacute;n final.</p>
<p>8. Para obtener la calificaci&oacute;n de APTO se deber&aacute;n haber realizado 
  correctamente todos los ejercicios del curso.</p>
<p>9. Para cualquier aclaraci&oacute;n sobre estas normas u otras cuestiones del 
  curso se puede contactar con los profesores del mismo:</p>
<p>Domingo Gallardo (<a href="mailto:%20domingo@dccia.ua.es">domingo@dccia.ua.es</a>)<br>
  Coordinador y responsable del m&oacute;dulo 1</p>
<p>Ignacio Iborra (<a href="mailto:%20iiborra@dccia.ua.es">iiborra@dccia.ua.es</a>)<br>
  Responsable de m&oacute;dulos 2 y 3 </p>
<p>&nbsp;</p>
</body>
</html>
