<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Gu&iacute;a de laboratorio</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="jtech" src="images/baner_j2ee_izq.gif" title="Especialista Universitario Java Enterprise"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Java y Herramientas de Desarrollo" src="images/baner_j2ee_der.gif" title="Java y Herramientas de Desarrollo"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="javascript:location.href='../index.html'">Home</a>
</li>
<li>
<a class="base-not-selected" href="javascript:location.href='../proy-int/index.html'">Proyecto SIGEM</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Java y Herramientas de Desarrollo</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Materiales</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_1.1.2', 'skin/')" id="menu_1.1.2Title" class="menutitle">Teor&iacute;a</div>
<div id="menu_1.1.2" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-apuntes.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html">Sesion 8</a>
</div>
<div class="menuitem">
<a href="sesion09-apuntes.html">Sesion 9</a>
</div>
<div class="menuitem">
<a href="sesion10-apuntes.html">Sesion 10</a>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.3', 'skin/')" id="menu_selected_1.1.3Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Ejercicios</div>
<div id="menu_selected_1.1.3" class="selectedmenuitemgroup" style="display: block;">
<div class="menupage">
<div class="menupagetitle">Sesion 1</div>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-ejercicios.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-ejercicios.html">Sesion 8</a>
</div>
<div class="menuitem">
<a href="sesion09-ejercicios.html">Sesion 9</a>
</div>
<div class="menuitem">
<a href="sesion10-ejercicios.html">Sesion 10</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion01-ejercicios.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Gu&iacute;a de laboratorio</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Cuentas+de+usuario">Cuentas de usuario</a>
<ul class="minitoc">
<li>
<a href="#Usuario+y+contrase%C3%B1a+del+curso">Usuario y contrase&ntilde;a del curso</a>
<ul class="minitoc">
<li>
<a href="#Apuntes">Apuntes</a>
</li>
<li>
<a href="#Repositorios+CVS">Repositorios CVS</a>
</li>
</ul>
</li>
</ul>
</li>
<li>
<a href="#C%C3%B3mo+trabajar+con+espacios+de+trabajos+de+Eclipse">C&oacute;mo trabajar con espacios de trabajos de Eclipse</a>
<ul class="minitoc">
<li>
<a href="#Creaci%C3%B3n+y+copia+de+espacios+de+trabajo">Creaci&oacute;n y copia de espacios de trabajo</a>
</li>
</ul>
</li>
<li>
<a href="#Uso+del+repositorio+CVS">Uso del repositorio CVS</a>
<ul class="minitoc">
<li>
<a href="#Creaci%C3%B3n+de+un+repositorio+CVS">Creaci&oacute;n de un repositorio CVS</a>
</li>
<li>
<a href="#C%C3%B3mo+subir+un+proyecto+al+repositorio+CVS">C&oacute;mo subir un proyecto al repositorio CVS</a>
</li>
<li>
<a href="#C%C3%B3mo+subir+al+repositorio+cambios+en+el+proyecto+local">C&oacute;mo subir al repositorio cambios en el proyecto local</a>
</li>
<li>
<a href="#C%C3%B3mo+explorar+el+repositorio">C&oacute;mo explorar el repositorio</a>
</li>
<li>
<a href="#C%C3%B3mo+descargar+un+proyecto+del+repositorio">C&oacute;mo descargar un proyecto del repositorio</a>
</li>
<li>
<a href="#Versiones+y+ramas">Versiones y ramas</a>
</li>
</ul>
</li>
</ul>
</div>


<p>En esta sesi&oacute;n de ejercicios vamos a describir los aspectos m&aacute;s importantes del uso del laboratorio para la realizaci&oacute;n de las pr&aacute;cticas del curso.</p>


<a name="N1000F"></a><a name="Cuentas+de+usuario"></a>
<h2 class="underlined_10">Cuentas de usuario</h2>
<div class="section">
<p>En el curso vas a tener que usar distintas cuentas de usuario en distintas aplicaciones. Intentamos aclarar todo en este apartado.</p>
<a name="N10018"></a><a name="Usuario+y+contrase%C3%B1a+del+curso"></a>
<h3 class="underlined_5">Usuario y contrase&ntilde;a del curso</h3>
<p>En el curso tenemos recursos protegidos en los que hay que identificarse con un usario y una contrase&ntilde;a. Se trata del servidor de apuntes (<span class="codefrag">http://www.jtech.ua.es/ayto2008/</span> y del servidor CVS.</p>
<p>En todos estos servicios tendr&aacute;s el mismo usuario y contrase&ntilde;a, que se te proporcionar&aacute; al comienzo del curso. Es posible cambiar la contrase&ntilde;a, pero hay que hacerlo en los distintos servicios. A continuaci&oacute;n presentamos algunos detalles de cada servicio y explicamos c&oacute;mo cambiar la contrase&ntilde;a en cada caso.</p>
<a name="N10027"></a><a name="Apuntes"></a>
<h4>Apuntes</h4>
<p>Los apuntes, trasparencias, plantillas para los ejercicios y dem&aacute;s material docente se encuentra en un sitio web restringido a los alumnos del curso. Puedes acceder a esta zona pinchando en el recuadro correspondiente (azul) en la web privada del curso (<span class="codefrag">http://www.jtech.ua.es/ayto2008</span>).</p>
<p>Podr&aacute;s solicitar cambiar tu contrase&ntilde;a desde la p&aacute;gina de login. Para ello, en lugar de introducir el login y password en dicha p&aacute;gina, pulsaremos sobre el enlace para cambiar la contrase&ntilde;a. Nos pedir&aacute; nuestra direcci&oacute;n de correo electr&oacute;nico con la que estamos registrados en el sitio web. Una vez introducida esta direcci&oacute;n, nos enviar&aacute; un correo a esa cuenta. En el correo se incluye un enlace con un c&oacute;digo especial que nos permitir&aacute; cambiar el password. Este enlace tiene una validez de 15 minutos. Pasado ese tiempo el c&oacute;digo ya no valdr&aacute;. Pulsamos sobre el enlace y nos aparecer&aacute; un formulario donde cambiar la contrase&ntilde;a. Una vez la hayamos cambiado, podremos acceder al sitio web con ella.</p>
<a name="N10037"></a><a name="Repositorios+CVS"></a>
<h4>Repositorios CVS</h4>
<p>Se han creado en el servidor del curso (<span class="codefrag">www.jtech.ua.es</span>) un conjunto de cuentas de usuario en las que crearemos los repositorios CVS a los que subiremos el trabajo realizado durante el curso. </p>
<p>Para acceder a tu cuenta debes conectarte con ssh (utilizando alguna herramienta de Windows como <em>Putty</em>) y entrar utilizando tu nombre de usuario y contrase&ntilde;a.</p>
<p>Para cambiar tu contrase&ntilde;a debes entrar en la cuenta y ejecutar el comando <span class="codefrag">passwd</span>. Supongamos que tu usuario es <span class="codefrag">iasimov</span>: </p>
<pre class="code">
ssh iasimov@www.jtech.ua.es 
iasimov@www.jtech.ua.es's password: CONTRASE&Ntilde;A ANTIGUA
www.jtech.ua.es$ passwd  
Changing password for user iasimov. 
Changing password for iasimov
(current) UNIX password: CONTRASE&Ntilde;A ANTIGUA
New password: NUEVA CONTRASE&Ntilde;A
Retype new password: NUEVA CONTRASE&Ntilde;A
passwd: all authentication tokens updated successfully. 
</pre>
<p>La nueva contrase&ntilde;a debe ser una buena contrase&ntilde;a UNIX: ser suficientemente larga y contener caracteres y n&uacute;meros. Si olvidaras la contrase&ntilde;a puedes enviar un correo al administrador del repositorio (malozano@dccia.ua.es). </p>
</div>


<a name="N1005C"></a><a name="C%C3%B3mo+trabajar+con+espacios+de+trabajos+de+Eclipse"></a>
<h2 class="underlined_10">C&oacute;mo trabajar con espacios de trabajos de Eclipse</h2>
<div class="section">
<p>Eclipse es el entorno de programaci&oacute;n que se va a usar en todas los m&oacute;dulos del curso. El trabajo en Eclipse se organiza en <strong>proyectos</strong> que se guardan en espacios de trabajo (<em>Workspaces</em>). Un espacio de trabajo se corresponde con un directorio f&iacute;sico del disco duro y los proyectos se corresponden con subdirectorios suyos. En el curso crearemos un espacio de trabajo por cada uno de los m&oacute;dulo.</p>
<p>Cuando arrancamos Eclipse por primera vez aparece un cuadro de di&aacute;logo en el que nos pide el espacio de trabajo en el que vamos a trabajar.</p>
<p>

<img alt="" content-width="10cm" src="imagenes/ejercicios01/eclipse-01.png">
</p>
<p>Por defecto, Eclipse sugiere el directorio <span class="codefrag">C:\Documents and Settings\</span><em>USUARIO</em><span class="codefrag">\workspace</span>. En el caso de los ordenadores de la EPS, el directorio es: <span class="codefrag">C:\Documents and Settings\eps\workspace</span>. Si aceptamos ese espacio de trabajo, Eclipse crea el directorio y comenzaremos a trabajar en &eacute;l. Tambi&eacute;n es podemos cambiar el nombre del espacio de trabajo y Eclipse crear&aacute; el directorio correspondiente. Por &uacute;ltimo, tambi&eacute;n podemos explorar el sistema de ficheros y escoger un espacio de trabajo previamente creado.</p>
<p>Una vez que hemos trabajado con Eclipse, creando distintos proyectos dentro del espacio de trabajo actual, es posible que queramos guardar una copia de seguridad del espacio de trabajo actual, o pas&aacute;rselo a alg&uacute;n compa&ntilde;ero para que siga trabajando con &eacute;l. Para ello no hay m&aacute;s que copiar el directorio espacio de trabajo.</p>
<p>Vamos a realizar un peque&ntilde;o ejercicio para aprender a trabajar con espacios de trabajo de Eclipse.</p>
<a name="N10089"></a><a name="Creaci%C3%B3n+y+copia+de+espacios+de+trabajo"></a>
<h3 class="underlined_5">Creaci&oacute;n y copia de espacios de trabajo</h3>
<p> En este peque&ntilde;o ejercicio vamos a comprobar lo sencillo que es guardar un espacio de trabajo Eclipse en el disco USB. Seguiremos los siguientes pasos:</p>
<ol>

<li>Abrimos Eclipse y creamos un espacio de trabajo llamado <em>presentacion</em>.</li>

<li>Creamos dos proyectos (<em>jhd-sesion01-proyecto1</em> y <em>jhd-sesion01-proyecto2</em>) y alg&uacute;n fichero dentro de los proyectos.</li>

<li>Movemos el espacio de trabajo a una ubicaci&oacute;n diferente.</li>

<li>Abrimos la nueva ubicaci&oacute;n con Eclipse. Comprobamos que est&aacute;n todos los proyectos.</li>

</ol>
<p>Vamos a continuaci&oacute;n a realizar estos pasos de forma detallada. Para crear el espacio de trabajo llamado <em>presentacion</em> no hay m&aacute;s que arrancar Eclipse y que cambiar el nombre del espacio de trabajo sugerido:</p>
<p>
<img alt="" content-width="10cm" src="imagenes/ejercicios01/eclipse-02.png"></p>
<p>Una vez arrancado Eclipse en el espacio de trabajo definido, tendr&aacute; el siguiente aspecto:</p>
<p>
<img alt="" content-width="10cm" src="imagenes/ejercicios01/eclipse-03.png" width="700"></p>
<p>En el panel vertical izquierdo aparecer&aacute;n los paquetes (todav&iacute;a no hemos creado ninguno). En el nombre de la ventana aparece la localizaci&oacute;n del espacio de trabajo actual.</p>
<p>Para crear un proyecto podemos escoger la opci&oacute;n <em>File</em>&gt;<em>New</em>&gt;<em>Project...</em> o pulsar el bot&oacute;n derecho sobre el panel de proyectos y escoger la opci&oacute;n <em>New</em>&gt;<em>Project...</em>. En cualquiera de estos casos, aparecer&aacute; un asistente que nos guiar&aacute; para crera el tipo de proyecto que deseemos. En esta primera sesi&oacute;n vamos a escoger el proyecto de tipo <em>General</em>: </p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/eclipse-04.png"></p>
<p>La siguiente pantalla del asistente nos pide el nombre del proyecto. Damos como nombre <em>jhd-sesion01-proyecto1</em>. Todos los nombres de proyecto vamos a escribirlos precedidos del nombre corto del m&oacute;dulo en que estemos haciendo los ejercicios.</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/eclipse-05.png"></p>
<p>Cuando pulsamos <em>Finish</em> Eclipse crea el proyecto. Aparece como una carpeta en el panel de proyectos. En el disco duro se habr&aacute; creado el directorio corresondiente.</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/eclipse-06.png"></p>
<p>Creamos ahora otro proyecto llamado <em>jhd-sesion01-proyecto2</em> de la misma forma que el proyecto anterior.</p>
<p>Para terminar con la creaci&oacute;n de proyectos, creamos un fichero en uno de los proyectos usando la opci&oacute;n <em>File</em>&gt;&gt;<em>New</em>&gt;<em>File</em>. Aparece el cuadro de di&aacute;logo siguiente, en el que se nos pide seleccionar el proyecto padre del fichero y su nombre. Lo llamamos <em>prueba.txt</em>
</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/eclipse-07.png"></p>
<p>Tras introducir el nombre del fichero, Eclipse abre un editor en el panel central en el que podremos editar el contenido del fichero. Escribamos cualquier cosa.</p>
<p>
<img alt="" content-width="10cm" src="imagenes/ejercicios01/eclipse-08.png" width="700"></p>
<p>Grabamos el fichero y cerramos Eclipse.</p>
<p>Si ahora exploramos el disco duro vemos que la estructura de directorios creados es id&eacute;ntica a la vista en Eclipse:</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/disco-duro-01.png"></p>
<p>La carpeta <em>presentacion</em> contiene un directorio <em>.metadata</em> que guarda la configuraci&oacute;n de Eclipse. A su vez, cada subdirectorio correspondiente a cada proyecto contiene un directorio <em>.project</em> en el que se guarda la configuraci&oacute;n de Eclipse relacionada con el proyecto. </p>
<p>Para copiar un espacio de trabajo basta pues con copiar la carpeta que contiene el directorio <em>.metadata</em>. Puedes hacer y copiarlo en otra ubicaci&oacute;n. Si abrimos Eclipse en esta nueva ubicaci&oacute;n ver&aacute;s que el aspecto del espacio de trabajo es el mismo que antes.</p>
<div class="frame note">
<div class="label">Nota</div>
<div class="content">Hay que hacer notar la gran portabilidad de los espacios de trabajo de Eclipse (debido sobre todo a que Eclipse est&aacute; desarrollado en Java). Es posible comenzar a trabajar con un espacio de trabajo en Windows y abrirlo y seguir trabajando en cualquier otro sistema operativo (Linux o Mac OS X). El &uacute;nico detalle a tener en cuenta es el de asegurarse de usar la misma codificaci&oacute;n de texto (<em>text encoding</em>) en todos los sistemas. Por defecto, Eclipse usa la codificaci&oacute;n de texto del sistema operativo, lo que puede dar lugar a problemas de compatibilidad al abrir ficheros de texto creados en otros sistemas operativos. Lo recomendable si vas a trabajar con distintos SOs es escoger una &uacute;nica codificaci&oacute;n (ISO-8859-1, por ejemplo) y un &uacute;nico delimitador de fin de linea (el de Unix, por ejemplo). Para escoger la codificaci&oacute;n en la que va a trabajar Eclipse hay que seleccionar la opci&oacute;n <em>Window</em>&gt;<em>Preferences</em>&gt;<em>General</em>&gt;<em>Workspace</em>.</div>
</div>
<p>Adem&aacute;s de realizar esta copia de seguridad de tus ejercicios, tambi&eacute;n te vamos a pedir que publiques los proyectos en el repositorio CVS. Lo explicamos en el siguiente apartado.</p>
</div>


<a name="N1014F"></a><a name="Uso+del+repositorio+CVS"></a>
<h2 class="underlined_10">Uso del repositorio CVS</h2>
<div class="section">
<p>La tecnolog&iacute;a CVS permite mantener un repositorio remoto en el que se guardar&aacute;n los distintos proyectos realizados en Eclipse. Mediante esta tecnolog&iacute;a es posible realizar un control de versiones, de forma que cada vez que se sube un proyecto al repositorio s&oacute;lo se guardan los cambios realizados con respecto a la versi&oacute;n ya existente. Es posible recuperar versiones anteriores del proyecto o incluso mantener varias ramas con versiones paralelas de un mismo proyecto.</p>
<p>

<img alt="" content-width="10cm" src="imagenes/ejercicios01/repositorio-cvs.png" width="600"> </p>
<p>CVS es muy usado en los equipos de desarrollo software, ya que permite que sincronizar un &uacute;nico repositorio remoto (donde se encuentra el proyecto en el que se est&aacute; trabajando) con m&uacute;ltiples clientes locales (desarrolladores), de forma que todos los clientes comparte el mismo proyecto, pueden subir sus cambios y mantenerse sus proyectos sincronizados.</p>
<p>El repositorio CVS del curso es accesible desde cualquier ordenador 
conectado a Internet. Cada alumno tiene disponible una cuenta de usuario
en la que podr&aacute; crear un repositorio CVS para mantener de forma remota 
los proyectos en los que est&aacute; trabajando.  </p>
<a name="N10167"></a><a name="Creaci%C3%B3n+de+un+repositorio+CVS"></a>
<h3 class="underlined_5">Creaci&oacute;n de un repositorio CVS</h3>
<p>Vamos a ver como crear un repositorio en una m&aacute;quina Linux en la
que tengamos instalado cvs y el demonio de ssh.</p>
<p>Lo primero que haremos es conectarnos a <span class="codefrag">www.jtech.ua.es</span>
mediante ssh y entrar en nuestra cuenta de usuario. Una vez dentro de 
nuestro directorio HOME, crearemos un subdirectorio <span class="codefrag">cvs</span>
para nuestro repositorio:</p>
<pre class="code">mkdir cvs</pre>
<p>Una vez creado el directorio, lo inicializaremos como repositorio
con el comando:</p>
<pre class="code">cvs -d /home/<em>mi_usuario</em>/cvs init</pre>
<div class="frame note">
<div class="label">Nota</div>
<div class="content">Es importante especificar la ruta absoluta a la hora
de inicializar el respositorio. Si se especifica de forma relativa no
funcionar&aacute; correctamente.</div>
</div>
<p>Los datos para acceder a este repositorio CVS ser&aacute;n los siguientes: </p>
<ul>

<li>
<strong>Direcci&oacute;n</strong>: <span class="codefrag">www.jtech.ua.es</span>
</li>

<li>
<strong>Ruta del repositorio</strong>: <span class="codefrag">/home/</span><em><span class="codefrag">mi_usuario</span></em><span class="codefrag">/cvs</span>
</li>

<li>
<strong>Modo de acceso</strong>: <span class="codefrag">extssh</span>
</li>

</ul>
<p>Aunque hayamos creado un repositorio individual para cada alumno, 
el uso com&uacute;n de CVS es el de gestionar las versiones de un proyecto en 
el que participe un grupo de desarrollo. Todos los integrantes del grupo
subir&aacute;n sus cambios a un &uacute;nico repositorio com&uacute;n. Por este motivo, 
el directorio del repositorio deber&aacute; tener permisos de lectura y 
escritura para todo este grupo de usuarios. Para ello podemos crear
en Linux un grupo, al que por ejemplo podemos llamar <span class="codefrag">j2ee</span>,
que integre a todos los miembros del equipo de desarrollo. Daremos
permisos de grupo al directorio de nuestro el repositorio con:</p>
<pre class="code">chgrp j2ee /usr/local/cvs
chmod g+ws /usr/local/cvs</pre>
<div class="frame warning">
<div class="label">Atenci&oacute;n</div>
<div class="content">Es de especial importancia el utilizar el <em>flag</em>
<span class="codefrag">s</span> a la hora de dar permisos al directorio. De esta forma, 
cuando alguien cree ficheros dentro de dicho directorio, se
crear&aacute;n con permisos para todo el grupo, y no s&oacute;lo para el usuario
individual que lo haya creado.</div>
</div>
<p>Es posible tambi&eacute;n que por motivos de seguridad no nos interese que
los miembros del grupo de desarrollo tengan cuentas de usuario en el 
servidor. Podr&iacute;amos utilizar <span class="codefrag">pserver</span> para
crear usuarios de CVS sin tener que crearles cuentas de Linux. En 
este caso utilizar&iacute;amos <span class="codefrag">pserver</span> para acceder al repositorio,
en lugar de <span class="codefrag">extssh</span>. </p>
<p>Existen m&uacute;ltiples clientes para operar con CVS. Uno de los m&aacute;s interesantes est&aacute; integrado en Eclipse. A continuaci&oacute;n vamos a ver de forma detallada c&oacute;mo operar con &eacute;l. </p>
<a name="N101CF"></a><a name="C%C3%B3mo+subir+un+proyecto+al+repositorio+CVS"></a>
<h3 class="underlined_5">C&oacute;mo subir un proyecto al repositorio CVS</h3>
<p>Supongamos que queremos guardar uno de los proyectos desarrollados en esta sesi&oacute;n, por ejemplo el proyecto <span class="codefrag">jhd-sesion01-proyecto2</span>. </p>
<div class="frame note">
<div class="label">Nota</div>
<div class="content">
Es necesario que todos los proyectos desarrollados en el curso tengan nombres distintos, ya que todos van a residir en el directorio ra&iacute;z de tu repositorio CVS. Para evitar coincidencias en el nombre de los proyectos, seguiremos la norma de que las primeras letras del proyecto ser&aacute; siempre el nombre corto del m&oacute;dulo en el que estamos trabajando (<span class="codefrag">jhd</span> para el m&oacute;dulo <em>Java y Herramientas de Desarrollo</em>, etc.).
</div>
</div>
<p>Para subir el proyecto al repositorio CVS hay que seleccionarlo, pulsar el bot&oacute;n derecho y escoger la opci&oacute;n <em>Team</em>&gt;<em>Share Project..</em>:</p>
<p>
<img alt="" content-width="10cm" src="imagenes/ejercicios01/cvs-01.png"> </p>
<p>Aparecer&aacute; una ventana en la que hay que proporcionar los datos del repositorio CVS. Estos datos se grabar&aacute;n en el directorio de trabajo de Eclipse y no tendr&aacute;s que introducirlos de nuevo. Es recomendable no grabar tu contrase&ntilde;a de usuario si est&aacute;s en un ordenador p&uacute;blico. </p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-02.png"> </p>
<p>A continuaci&oacute;n debemos indicar cu&aacute;l ser&aacute; el nombre que en el repositorio CVS va a tener el proyecto que vamos a subir. Es lo que se denomina <em>nombre del m&oacute;dulo CVS</em>. Escogemos la opci&oacute;n por defecto de Eclipse (<em>usar el nombre del proyecto como nombre del m&oacute;dulo CVS</em>):</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-03.png"> </p>
<p>Pulsando el bot&oacute;n <em>Next&gt;</em> aparecer&aacute; la siguiente pantalla en la que podr&aacute;s revisar qu&eacute; ficheros se van a guardar en el m&oacute;dulo reci&eacute;n creado. Aparecen con un signo + los ficheros que se van a a&ntilde;adir al m&oacute;dulo.</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-04.png"> </p>
<p>A continuaci&oacute;n pulsamos <em>Finish</em> y aparecer&aacute; la pantalla con el comando commit. El comando commit es un comando CVS con el que se guardan los cambios en el repositorio, as&iacute; como los comentarios sobre dichos cambios que consideremos oportunos. Es conveniente rellenar siempre los comentarios, porque ser&aacute;n &uacute;tiles para examinar la historia de cambios. </p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-05.png"> </p>
<p>Una vez guardados los ficheros en el repositorio, el proyecto quedar&aacute; enlazado al repositorio CVS. En el panel de proyectos de Eclipse aparece el servidor CVS asociado al proyecto y todos los ficheros y proyectos enlazados aparecen con un icono especial: </p>
<p>
<img alt="" content-width="4cm" src="imagenes/ejercicios01/cvs-06.png"> </p>
<div class="frame note">
<div class="label">Nota</div>
<div class="content">
La conexi&oacute;n entre los proyectos locales y repositorio CVS queda grabada en el disco duro en forma de unos directorios <span class="codefrag">CVS</span> que se crean en los directorios enlazados. Los datos del repositorio CVS quedan tambi&eacute;n grabados en el espacio de trabajo. De esta forma, al copiar el espacio de trabajo tambi&eacute;n se copia la conexi&oacute;n con el repositorio CVS.
</div>
</div>
<a name="N10239"></a><a name="C%C3%B3mo+subir+al+repositorio+cambios+en+el+proyecto+local"></a>
<h3 class="underlined_5">C&oacute;mo subir al repositorio cambios en el proyecto local</h3>
<p>Una vez creado o descargado un repositorio en un proyecto haremos modificaciones en el proyecto local: modificaremos el contenido de alg&uacute;n fichero, crearemos nuevos ficheros y directorios o borraremos ficheros existentes. Eclipse marca todos aquellos recursos que se han modificado con un s&iacute;mbolo especial ("&gt;").  </p>
<p>Por ejemplo, selecciona el fichero <span class="codefrag">prueba.txt</span>, modifica su texto y gr&aacute;balo. Eclipse debe mostrar lo siguiente: </p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-07.png"> </p>
<p>Nota que se han marcado los ficheros que se van a modificar en el repositorio. Para grabar (commit) los cambios en el repositorio, pincha el proyecto <span class="codefrag">jhd-sesion01-proyecto2</span> y selecciona con el bot&oacute;n derecho del rat&oacute;n la opci&oacute;n <em>Team</em>&gt;<em>Commit....</em>:</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-08.png"> </p>
<p>Al igual que cuando subes el proyecto por primera vez, aparecer&aacute; la ventana Commit en la que podr&aacute;s escribir un comentario sobre los cambios que has realizado. Una vez que aceptas el commit, Eclipse se conecta con el repositorio y actualiza los cambios. Ver&aacute;s que desaparece el signo "&gt;" que marcaba las diferencias con el repositorio. </p>
<a name="N10266"></a><a name="C%C3%B3mo+explorar+el+repositorio"></a>
<h3 class="underlined_5">C&oacute;mo explorar el repositorio</h3>
<p>Para explorar el repositorio debes abrir la <em>perspectiva</em> (conjunto de paneles de Eclipse) <em>CVS Repository Exploring</em>. Para ello selecciona la opci&oacute;n <em>Window</em>&gt;<em>Open Perspective</em>&gt;<em>CVS Repository Exploring</em>. Eclipse mostrar&aacute; el panel <em>CVS Repositories</em> con todos los repositorios CVS definidos (en este caso, s&oacute;lo uno):</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-09.png"> </p>
<p>Podemos desplegar el repositorio y examinar su contenido. La rama <em>HEAD</em> corresponde a la rama principal. En otras sesiones veremos c&oacute;mo crear ramas alternativas de un proyecto.</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-10.png"> </p>
<p>Pinchando en <span class="codefrag">prueba.txt</span> y pulsando el bot&oacute;n derecho podr&aacute;s ver los comandos que puedes usar sobre un recurso del repositorio. El m&aacute;s com&uacute;n es <em>Show History</em>, que muestra las anotaciones de los sucesivos cambios que has ido guardando: </p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-11.png"> </p>
<p>Para volver a la perspectiva anterior, debes seleccionar la perspectiva <em>Resource</em> en la parte superior derecha de la ventana principal de Eclipse:</p>
<p>
<img alt="" content-width="4cm" src="imagenes/ejercicios01/cvs-12.png"> </p>
<a name="N102B3"></a><a name="C%C3%B3mo+descargar+un+proyecto+del+repositorio"></a>
<h3 class="underlined_5">C&oacute;mo descargar un proyecto del repositorio</h3>
<p>Por &uacute;ltimo, vamos a ver c&oacute;mo descargar un proyecto del repositorio CVS a un espacio de trabajo nuevo. Para ello, creamos un espacio de trabajo nuevo con la opci&oacute;n de Eclipse <em>File</em>&gt;<em>Switch Workspace...</em>. Escribimos un nuevo nombre de espacio de trabajo para crearlo (por ejemplo, <span class="codefrag">presentacion2</span>).</p>
<p>Una vez abierto el nuevo espacio de trabajo abrimos el asistente de creaci&oacute;n de proyectos y seleccionamos la opci&oacute;n <em>CVS</em>&gt;<em>Projects from CVS</em>:</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-13.png"> </p>
<p>Seleccionamos la localizaci&oacute;n del repositorio que nos proponen por defecto y seleccionamos el proyecto que queremos descargar:</p>
<p>
<img alt="" content-width="6cm" src="imagenes/ejercicios01/cvs-14.png"> </p>
<a name="N102E0"></a><a name="Versiones+y+ramas"></a>
<h3 class="underlined_5">Versiones y ramas</h3>
<p>Hemos visto los fundamentos b&aacute;sicos de trabajo con CVS. Cada d&iacute;a, cuando comenzamos
a trabajar en nuestro proyecto hacemos <em>update</em> para actualizar en nuestra copia local
los cambios que otros puedan haber hecho en el repositorio, y una vez hayamos terminado
nuestro trabajo haremos <em>commit</em> para subir nuestros cambios al servidor.</p>
<p>Con esto un integrante de un grupo de trabajo podr&aacute; participar en un desarrollo com&uacute;n
teniendo siempre en su m&aacute;quina los &uacute;ltimos cambios que hayan realizado el resto de
componentes del grupo. Pero la utilidad de CVS no s&oacute;lo se limita a esto, sino que tambi&eacute;n 
nos va a permitir mantener diferentes versiones de nuestro sistema.</p>
<p>Una versi&oacute;n en CVS es una instant&aacute;nea que se toma del sistema en un momento dado.
Normalmente crearemos una versi&oacute;n por cada <em>release</em> que hagamos de la aplicaci&oacute;n.
Para hacer esto en Eclipse tenemos la opci&oacute;n <em>Tag As Version</em>. Al crear una versi&oacute;n
deberemos darle una etiqueta para identificarla. Posteriormente podremos descargar esta versi&oacute;n
y as&iacute; recuperar el sistema tal como era en ese momento. </p>
<p>Es importante remarcar que una versi&oacute;n
no es modificable, es s&oacute;lo, como hemos dicho, una fotograf&iacute;a del sistema 
en un momento dado. Si se permitiese modificarla se perder&iacute;a su utilidad 
principal, que es la de en cualquier momento poder recuperar una configuraci&oacute;n
previa de nuestro sistema tal como era en el momento que se guard&oacute;.</p>
<p>Ahora imaginemos que hemos lanzado una versi&oacute;n 1.00 y la hemos puesto
en producci&oacute;n. A continuaci&oacute;n nos ponemos a trabajar en una serie de grandes
cambios de cara a sacar una versi&oacute;n 2.00. Algo pr&aacute;cticamente inevitable es 
que durante ese tiempo aparezca alg&uacute;n <em>bug</em> en la versi&oacute;n 1.00 que
actualmente esta siendo utilizada, y deber&iacute;amos ser capaces de sacar un parche
para esta versi&oacute;n lo m&aacute;s r&aacute;pidamente posible. Sin embargo, si estamos metidos
en una serie de grandes cambios para la versi&oacute;n 2.00 podremos tardar bastante
en dejar listo este sistema para ser puesto en producci&oacute;n.</p>
<p>La soluci&oacute;n a este problema nos la proporcionan las ramas. Con CVS podemos 
crear varias ramas de desarrollo dentro de un mismo proyecto. Por defecto
estamos en una rama llamada <span class="codefrag">HEAD</span>, en la que tenemos el desarrollo
principal. Sin embargo, en cualquier momento del desarrollo podremos crear 
una rama de desarrollo independiente (con <em>Branch</em> en Eclipse) en la que podamos hacer cambios sin
afectar al resto de ramas.</p>
<p>En nuestro caso crearemos una nueva rama a partir de la versi&oacute;n 1.0. De 
esta forma tendremos dos ramas: la rama <span class="codefrag">HEAD</span> del desarrollo principal,
en la que realizaremos los cambios para la versi&oacute;n 2.0, y una rama de mantenimiento
para la versi&oacute;n 1.0. En esta segunda rama tendremos el sistema tal como era en 
el momento de hacer la <em>release</em> de la versi&oacute;n 1.0, por lo que con
ella podremos de forma r&aacute;pida solucionar los <em>bugs</em> aparecidos en
la versi&oacute;n 1.0 y sacar as&iacute; la versi&oacute;n 1.01 y sucesivas correcciones, mientras
en paralelo se trabaja con los cambios para la versi&oacute;n 2.0.</p>
<div class="frame note">
<div class="label">Recuerda</div>
<div class="content">Las versiones no se pueden modificar. Si queremos
hacer cambios a partir de la configuraci&oacute;n que ten&iacute;a el sistema en una versi&oacute;n,
deberemos crear una rama de desarrollo a partir de ella.</div>
</div>
<p>Una vez terminada la versi&oacute;n 2.0, ser&aacute; deseable poder a&ntilde;adir a esta 
versi&oacute;n de forma autom&aacute;tica todas las correcciones que hayamos ido haciendo 
a la versi&oacute;n 1.0 en su rama de mantenimiento, sin tener que volver
a solucionar todos estos fallos a mano. Para ello tenemos la opci&oacute;n de
fusionar ramas (<em>Merge</em>). Podemos fusionar los cambios de la rama
de mantenimiento dentro de la rama <span class="codefrag">HEAD</span>, y as&iacute; se realizar&aacute;n 
en esta &uacute;ltima rama todas las correcciones que hicimos en la anterior.</p>
</div>


<p class="pageBreakAfter"></p>



</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2008-2009 Depto. CCIA</div>
</div>
</body>
</html>
