<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta content="Apache Forrest" name="Generator">
<meta name="Forrest-version" content="0.7">
<meta name="Forrest-skin-name" content="pelt">
<title>Introducci&oacute;n a Java EE</title>
<link type="text/css" href="skin/basic.css" rel="stylesheet">
<link media="screen" type="text/css" href="skin/screen.css" rel="stylesheet">
<link media="print" type="text/css" href="skin/print.css" rel="stylesheet">
<link type="text/css" href="skin/profile.css" rel="stylesheet">
<script src="skin/getBlank.js" language="javascript" type="text/javascript"></script><script src="skin/getMenu.js" language="javascript" type="text/javascript"></script><script src="skin/fontsize.js" language="javascript" type="text/javascript"></script>
<link rel="shortcut icon" href="">
</head>
<body onload="init()">
<script type="text/javascript">ndeSetTextSize();</script>
<div id="top">
<div class="header">
<div class="grouplogo">
<a href="http://www.jtech.ua.es/j2ee"><img class="logoImage" alt="jtech" src="images/baner_j2ee_izq.gif" title="Especialista Universitario Java Enterprise"></a>
</div>
<div class="projectlogoA1">
<a href="http://www.dccia.ua.es/"><img class="logoImage" alt="Java y Herramientas de Desarrollo" src="images/baner_j2ee_der.gif" title="Java y Herramientas de Desarrollo"></a>
</div>
<ul id="tabs">
<li>
<a class="base-not-selected" href="javascript:location.href='../index.html'">Home</a>
</li>
<li>
<a class="base-not-selected" href="javascript:location.href='../proy-int/index.html'">Proyecto SIGEM</a>
</li>
<li class="current">
<a class="base-selected" href="index.html">Java y Herramientas de Desarrollo</a>
</li>
</ul>
</div>
</div>
<div id="main">
<div id="publishedStrip">
<div id="level2tabs"></div>
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="breadtrail">
             
             &nbsp;
           </div>
<div id="menu">
<div onclick="SwitchMenu('menu_selected_1.1', 'skin/')" id="menu_selected_1.1Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Materiales</div>
<div id="menu_selected_1.1" class="selectedmenuitemgroup" style="display: block;">
<div class="menuitem">
<a href="index.html" title="Java y Herramientas de Desarrollo">&Iacute;ndice</a>
</div>
<div onclick="SwitchMenu('menu_selected_1.1.2', 'skin/')" id="menu_selected_1.1.2Title" class="menutitle" style="background-image: url('skin/images/chapter_open.gif');">Teor&iacute;a</div>
<div id="menu_selected_1.1.2" class="selectedmenuitemgroup" style="display: block;">
<div class="menupage">
<div class="menupagetitle">Sesion 1</div>
</div>
<div class="menuitem">
<a href="sesion02-apuntes.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-apuntes.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-apuntes.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-apuntes.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-apuntes.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-apuntes.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-apuntes.html">Sesion 8</a>
</div>
<div class="menuitem">
<a href="sesion09-apuntes.html">Sesion 9</a>
</div>
<div class="menuitem">
<a href="sesion10-apuntes.html">Sesion 10</a>
</div>
<div class="menuitem">
<a href="roadmap-apuntes.html">Roadmap</a>
</div>
</div>
<div onclick="SwitchMenu('menu_1.1.3', 'skin/')" id="menu_1.1.3Title" class="menutitle">Ejercicios</div>
<div id="menu_1.1.3" class="menuitemgroup">
<div class="menuitem">
<a href="sesion01-ejercicios.html">Sesion 1</a>
</div>
<div class="menuitem">
<a href="sesion02-ejercicios.html">Sesion 2</a>
</div>
<div class="menuitem">
<a href="sesion03-ejercicios.html">Sesion 3</a>
</div>
<div class="menuitem">
<a href="sesion04-ejercicios.html">Sesion 4</a>
</div>
<div class="menuitem">
<a href="sesion05-ejercicios.html">Sesion 5</a>
</div>
<div class="menuitem">
<a href="sesion06-ejercicios.html">Sesion 6</a>
</div>
<div class="menuitem">
<a href="sesion07-ejercicios.html">Sesion 7</a>
</div>
<div class="menuitem">
<a href="sesion08-ejercicios.html">Sesion 8</a>
</div>
<div class="menuitem">
<a href="sesion09-ejercicios.html">Sesion 9</a>
</div>
<div class="menuitem">
<a href="sesion10-ejercicios.html">Sesion 10</a>
</div>
</div>
</div>
<div id="credit"></div>
<div id="roundbottom">
<img style="display: none" class="corner" height="15" width="15" alt="" src="skin/images/rc-b-l-15-1body-2menu-3menu.png"></div>
<div id="credit2"></div>
</div>
<div id="content">
<div title="Portable Document Format" class="pdflink">
<a class="dida" href="sesion01-apuntes.pdf"><img alt="PDF -icon" src="skin/images/pdfdoc.gif" class="skin"><br>
        PDF</a>
</div>
<h1>Introducci&oacute;n a Java EE</h1>
<div id="minitoc-area">
<ul class="minitoc">
<li>
<a href="#Introducci%C3%B3n">Introducci&oacute;n</a>
<ul class="minitoc">
<li>
<a href="#Una+breve+historia+de+Java+a+trav%C3%A9s+de+sus+versiones">Una breve historia de Java a trav&eacute;s de sus versiones</a>
</li>
</ul>
</li>
<li>
<a href="#Arquitecturas+de+aplicaciones+y+tecnolog%C3%ADas+Java">Arquitecturas de aplicaciones y tecnolog&iacute;as Java</a>
<ul class="minitoc">
<li>
<a href="#Terminales+de+servidor%3A+1+capa">Terminales de servidor: 1 capa</a>
</li>
<li>
<a href="#Aplicaciones+cliente-servidor%3A+2+capas">Aplicaciones cliente-servidor: 2 capas</a>
</li>
<li>
<a href="#Aplicaciones+multi-capa%3A+3+o+m%C3%A1s+capas">Aplicaciones multi-capa: 3 o m&aacute;s capas</a>
</li>
</ul>
</li>
<li>
<a href="#Tecnolog%C3%ADas+Java+EE">Tecnolog&iacute;as Java EE</a>
<ul class="minitoc">
<li>
<a href="#Capas+de+una+aplicaci%C3%B3n+enterprise">Capas de una aplicaci&oacute;n enterprise</a>
<ul class="minitoc">
<li>
<a href="#Capa+de+presentaci%C3%B3n">Capa de presentaci&oacute;n</a>
</li>
<li>
<a href="#Capa+de+negocio">Capa de negocio</a>
</li>
<li>
<a href="#Capa+de+datos">Capa de datos</a>
</li>
<li>
<a href="#Servicios+de+soporte">Servicios de soporte</a>
</li>
<li>
<a href="#Arquitectura+de+aplicaciones+Java+Enterprise">Arquitectura de aplicaciones Java Enterprise</a>
</li>
</ul>
</li>
<li>
<a href="#Servidores+y+contenedores">Servidores y contenedores</a>
</li>
</ul>
</li>
<li>
<a href="#Enlaces+de+inter%C3%A9s">Enlaces de inter&eacute;s</a>
</li>
</ul>
</div>



<a name="N1000C"></a><a name="Introducci%C3%B3n"></a>
<h2 class="underlined_10">Introducci&oacute;n</h2>
<div class="section">
<p>El lenguaje de programaci&oacute;n Java fue desarrollado en 1991 por James Gosling y Sun Microsystems y lanzado al mercado en 1995 con la idea principal de construir peque&ntilde;as aplicaciones (<em>applets</em>) que se ejecutaban dentro de los navegadores (<em>browsers</em>) de p&aacute;ginas Web.</p>
<p>En aquella &eacute;poca los visionarios de Sun se imaginaban un mundo en el que todos los computadores estaban conectados a Internet y los navegadores eran m&aacute;s importantes que los propios sistemas operativos en los que se ejecutaban. De esta forma, los applets (y Java) se convertir&iacute;an de facto en la nueva forma de programar aplicaciones.</p>
<p>La primera parte de la predicci&oacute;n se ha cumplido. Pero no la segunda. La mayor&iacute;a de los ordenadores est&aacute;n continuamente conectados a Internet. Pero los sistemas operativos siguen siendo m&aacute;s importantes que los navegadores. Microsoft ha cedido algo de poder a Linux y Apple, pero todas estas empresas siguen luchando para proporcionar la mejor experiencia a usuarios. Unos usuarios que quieren que sus computadores hagan algo m&aacute;s que ejecutar unas peque&ntilde;as aplicaciones dentro de un navegador Web.</p>
<p>Los navegadores Web de hoy en d&iacute;a proporcionan bastante m&aacute;s interactividad que en 1995, pero las aplicaciones que ejecutan tienen otros lenguajes distintos a Java, ya casi no vemos applets. Vemos sobre todo programas en JavaScript (un lenguaje de script basado en Java, pero distinto de &eacute;l) y en Flash (desarrollado por Macromedia y ahora propiedad de Adobe). Parecer&iacute;a que Java no ha tenido &eacute;xito, pero todo lo contrario.</p>
<p>El &eacute;xito de Java ha consistido precisamente en no encerrarse en los navegadores y en abarcar un gran n&uacute;mero de plataformas. Su car&aacute;cter multiplaforma lo hacen el lenguaje de programaci&oacute;n ideal para programar aplicaciones que se ejecutan en tel&eacute;fonos m&oacute;viles (juegos, por ejemplo). Tambi&eacute;n existen m&uacute;ltiples aplicaciones Java de escritorio que se ejecutan en los distintos sistemas operativos existentes (entornos de programaci&oacute;n, editores de texto, herramientas de tratamiento de im&aacute;genes, etc.). Pero donde Java ha tenido un &eacute;xito sobresaliente ha sido en el desarrollo de m&uacute;ltiples APIs (<em>Application Programming Interface</em>) multiplataforma y de aplicaciones y <em>frameworks</em> para la programaci&oacute;n en entornos de Internet. En esto &uacute;ltimo es en lo que consiste Java EE (<em>Enterprise Edition</em>).</p>
<p>El car&aacute;cter multiplataforma de Java tambi&eacute;n lo hacen ideal para el mundo de las aplicaciones empresariales (<em>enterprise applications</em>) o corporativas. Este es un mundo con aplicaciones multi-usuario que hacen un uso intesivo de las bases de datos, la conectividad y la seguridad. </p>
<p>Hist&oacute;ricamente, el mundo corporativo estuvo dominado por sistemas propietarios. Cada vendedor de <em>mainframes</em> (IBM, HP, Bull, etc.) impon&iacute;a un sistema operativo propio, con sus propios lenguajes y entornos de desarrollo. La industria inform&aacute;tica pronto se dio cuenta de que este no era el modelo adecuado. Se hicieron evidentes problemas fundamentales como el dif&iacute;cil desarrollo y la complejidad de interconexi&oacute;n de aplicaciones, o como la falta de formaci&oacute;n y escasez de profesionales inform&aacute;ticos competentes. A finales de los 80 y comienzos de los 90 la industria inform&aacute;tica corporativa fue convergiendo hacia est&aacute;ndares abiertos (UNIX, SQL, TCP/IP, C, ...) surgidos en laboratorios de investigaci&oacute;n de universidades o de las propias compa&ntilde;&iacute;as inform&aacute;ticas y de telecomunicaciones (como AT&amp;T), lo que permiti&oacute; un mayor aprovechamiento y reutilizaci&oacute;n de recursos y capacidades. En este contexto surge Internet y se hacen m&aacute;s evidentes todav&iacute;a los problemas de las plataformas cerradas y con problemas de conexi&oacute;n. La popularizaci&oacute;n de las tecnolog&iacute;as Java en este entorno es debido principalmente a que Java abraza los est&aacute;ndares abiertos antes comentados y construye sobre ellos una amplia colecci&oacute;n de servicios que son f&aacute;cilmente transportables (se programan m&aacute;quinas virtuales Java para todas las versiones de UNIX) e interconectables.</p>
<a name="N1003C"></a><a name="Una+breve+historia+de+Java+a+trav%C3%A9s+de+sus+versiones"></a>
<h3 class="underlined_5">Una breve historia de Java a trav&eacute;s de sus versiones</h3>
<p>La historia de Java viene definida por las distintas versiones de la tecnolog&iacute;a que ha ido lanzando Sun. En cada nuevo lanzamiento se han a&ntilde;adido nuevas APIs, y se han definido nuevas funcionalidades para las ya existentes. En los distintos lanzamientos, se han ido reagrupando APIs y herramientas (compiladores, m&aacute;quinas virtuales, generadores de documentaci&oacute;n, etc.) en grandes &aacute;reas tecnol&oacute;gicas, dependiendo de las plataformas en las que se van a ejecutar los programas Java.</p>
<p>
<img alt="" content-width="8cm" src="imagenes/apuntes01/plataformas-java.png" width="400"> </p>
<p>En la actualidad Sun proporciona tres grandes <em>distribuciones</em> (o <em>ediciones</em>): </p>
<ul>

<li>
<strong>Java ME</strong> (<em>Java Micro Edition</em>) para el desarrollo de aplicaciones Java en peque&ntilde;os dispositivos (m&oacute;viles, tarjetas de cr&eacute;dito, bluetooth, televisiones o reproductores blu-ray). </li>

<li>
<strong>Java SE</strong> (<em>Java Standard Edition</em>) para el desarrollo de <em>aplicaciones de escritorio</em> en ordenadores personales.</li>

<li>
<strong>Java EE</strong> (<em>Java Enterprise Edition</em>) para el desarrollo de aplicaciones distribuidas (cliente-servidor o con m&uacute;ltiples capas) como aplicaciones web o servicios web.</li>

</ul>
<p>La historia de las versiones de estas distribuciones Java es la siguiente:</p>
<ul>

<li>
<strong>Enero de 1996</strong>: <strong>JDK 1.0</strong>. Lanzamiento de JDK (Java Development Kit) 1.0, la primera versi&oacute;n del lenguaje.</li>

<li>
<strong>Febrero de 1997</strong>: <strong>JDK 1.1</strong>. lanzamiento de JDK 1.1, que inclu&iacute;a la primera versi&oacute;n de JDBC y de RMI (llamadas a objetos remotos).</li>

<li>
<strong>Diciembre de 1998</strong>: <strong>J2SE 1.2</strong>. En el primer cambio de nombre, la plataforma pasa a llamarse J2SE (Java 2 Platform, Standard Edition). La versi&oacute;n inicial de la distribuci&oacute;n SE es la 1.2 (para mantener la numeraci&oacute;n de versiones consistente con la del JDK). Se introducen importantes cambios en el lenguaje y en la plataforma. Se introduce la API Swing para el desarrollo de interfaces de usuario.</li>

<li>
<strong>Diciembre de 1999</strong>: <strong>J2EE 1.2</strong>. Aparece la primera versi&oacute;n de Java Enterprise, que incluye: JSP, Servlets, JDBC, EJB, JMS, JTA y JavaMail.</li>

<li>
<strong>Mayo de 2000</strong>: <strong>J2SE 1.3</strong>. Mejora la eficiencia de Java con la m&aacute;quina virtual <em>HotSpot</em>. </li>

<li>
<strong>Septiembre de 2001</strong>: <strong>J2EE 1.3</strong>. Segunda versi&oacute;n de Java Enterprise, en la que se mejora el rendimiento de los EJB (EJB 2.0) y se introducen nuevas versiones de las APIs como JSP 1.2 o servlets 2.3.</li>

<li>
<strong>Febrero de 2002</strong>: <strong>J2SE 1.4</strong>. Se introducen APIs para tratar XML (JAXP), seguridad y criptograf&iacute;a (JCE, JSSE, JAAS). Se incluye Java Web Start para la distribuci&oacute;n remota de aplicaciones Java de escritorio.</li>

<li>
<strong>Noviembre de 2003</strong>: <strong>J2EE 1.4</strong>. Nuevas versiones de las APIs: EJB 2.1, JSP 1.3, Servlets 2.4, JDBC 3.0. Se introducen por primera vez las librer&iacute;as para los servicios Web.</li>

<li>
<strong>Septiembre de 2004</strong>: <strong>J2SE 1.5</strong>. Importantes cambios en el lenguaje: gen&eacute;ricos, anotaciones,  enumeraciones o iteraci&oacute;n.</li>

<li>
<strong>Mayo de 2006</strong>: <strong>Java EE 5</strong>. Otro cambio de nomenclatura de la plataforma, junto con un gran cambio en bastantes APIs. Se elimina el 2 despu&eacute;s de la palabra Java y se elimina el 1 del n&uacute;mero de versi&oacute;n. Se introduce la especificaci&oacute;n 3.0 de los EJB con anotaciones, uso de persistencia (JPA) y timers. Nuevas versiones de APIs: JSP 2.1, Servlets 2.5, JDBC 4.0. Se introduce JSF y mejoras en los servicios Web.</li>

<li>
<strong>Diciembre de 2006</strong>: <strong>Java SE 6</strong>. Se incluye el cambio de nomenclatura que elimina el 2 despu&eacute;s de Java. Mejoras en el rendimiento de Swing. Mejoras: Servicios web en Java SE, scripting (soporte para Python y Ruby), Java DB (base de datos basada en Apache Derby).  </li>

</ul>
</div>



<a name="N100D7"></a><a name="Arquitecturas+de+aplicaciones+y+tecnolog%C3%ADas+Java"></a>
<h2 class="underlined_10">Arquitecturas de aplicaciones y tecnolog&iacute;as Java</h2>
<div class="section">
<p>Cuando se dise&ntilde;a una aplicaci&oacute;n distribuida hay que decidir qu&eacute; tipo de arquitectura se va a utilizar.</p>
<p>En una aplicaci&oacute;n distribuida siempre existen dos elementos fundamentales: <em>procesos</em> y <em>peticiones</em>. Estos elementos toman distintos nombres y se implementan de distinta forma en distintas tecnolog&iacute;as. Por ejemplo, en una apliaci&oacute;n Web t&iacute;pica un proceso (el proceso cliente) ser&iacute;a el <em>hilo</em> del navegador Web que muestra la p&aacute;gina web y otro proceso (el proceso servidor) ser&iacute;a el <em>servlet</em> que se ejecuta en el servidor Web. Ambos se comunican intercambiando peticiones HTTP.</p>
<p> Dependiendo de la tecnolog&iacute;a, variar&aacute; el entorno en que se ejecuten los procesos, el lenguaje en el que &eacute;stos se definen e incluso los nombres que reciban. Tambi&eacute;n cada tecnolog&iacute;a de aplicaci&oacute;n distribuida utilizada define un tipo de formato de petici&oacute;n y un contenido de estas peticiones.</p>
<p>La configuraci&oacute;n de estos elementos constituyen la arquitectura de la aplicaci&oacute;n distribuida. Es posible configurar distintos tipos de aplicaciones distribuidas, en funci&oacute;n de las necesidades de la empresa o de la aplicaci&oacute;n. La plataforma Java Enterprise es flexible y permite usar m&uacute;ltiples tecnolog&iacute;as. El hecho de que todas las tecnolog&iacute;as est&eacute;n basadas en Java y en est&aacute;ndares aprobados por el comunidad Java asegura su interoperabilidad.</p>
<p>Otro elemento fundamental de las arquitecturas es c&oacute;mo se particiona la l&oacute;gica de la aplicaci&oacute;n en distintas capas. Habitualmente, en las aplicaciones enterprise se diferencian las siguientes capas:</p>
<ul>

<li>
<strong>Capa de presentaci&oacute;n</strong>: encargada de presentar y obtener la informaci&oacute;n a los usuarios finales</li>

<li>
<strong>Capa de negocio</strong>: encargada de realizar las operaciones de la aplicaci&oacute;n (ejemplos: prestar un libro, consultar viabilidad de un pr&eacute;stamo, calcular el recibo de una matr&iacute;cula, etc.)</li>

<li>
<strong>Capa de datos</strong>: encargada de consultar y modificar los datos persistentes (bases de datos) de la aplicaci&oacute;n</li>

<li>
<strong>Servicios del sistema</strong>: servicios de soporte como seguridad, transaccionalidad, logs, etc.</li>

</ul>
<p>Veamos algunos ejemplos de distintas arquitecturas t&iacute;picas, indicando algunas de las ventajas e inconvenientes de cada una de ellas.</p>
<a name="N10112"></a><a name="Terminales+de+servidor%3A+1+capa"></a>
<h3 class="underlined_5">Terminales de servidor: 1 capa</h3>
<p>

<img alt="" content-width="8cm" src="imagenes/apuntes01/arquitectura-una-capa.png" width="400"> 
</p>
<p>En esta arquitectura toda la aplicaci&oacute;n se desarrolla en el servidor. Los m&uacute;ltiples usuarios est&aacute;n conectados al servidor mediante <em>terminales tontas</em> que &uacute;nicamente muestran en pantalla la actividad que est&aacute; realizando el servidor (un <em>mainframe</em>). La aplicaci&oacute;n es monol&iacute;tica y centralizada. El servidor es el responsable de todas las capas de la aplicaci&oacute;n.</p>
<p>Se trata de una arquitectura obsoleta, propia de los a&ntilde;os 80. En aquella &eacute;poca la mayor&iacute;a de aplicaciones multi-usuario ten&iacute;a esta arquitectura. Los mainframes soportaban un n&uacute;mero limitado de terminales, ocupadas por los administrativos de la empresa que introduc&iacute;an datos y solicitaban listados.</p>
<p>La &uacute;nica forma de escalar esta arquitectura (aumentar sus prestaciones cuando es necesario aumentar el n&uacute;mero de usuarios) es migrar la aplicaci&oacute;n a un mainframe m&aacute;s potente (y comprar m&aacute;s terminales).</p>
<p>Una ventaja de este tipo de aplicaciones es que es muy sencillo de mantener y desplegar, ya que no hay que instalar ninguna aplicaci&oacute;n en los clientes. De hecho, a finales de los 90, en un extra&ntilde;o <em>revival</em> liderado por Sun y Oracle, se intent&oacute; volver a este tipo de aplicaciones monol&iacute;ticas con los <em>network computers</em>. El fracaso fue estrepitoso. Una vez que un usuario ha conocido un PC, es muy dif&iacute;cil hacerle volver a un terminal tonto.</p>
<a name="N1013A"></a><a name="Aplicaciones+cliente-servidor%3A+2+capas"></a>
<h3 class="underlined_5">Aplicaciones cliente-servidor: 2 capas</h3>
<p>

<img alt="" content-width="7cm" src="imagenes/apuntes01/arquitectura-dos-capas.png" width="300"> 
</p>
<p>En las aplicaciones cliente-servidor t&iacute;picas, los usuarios ejecutan la aplicaci&oacute;n en ordenadores <em>cliente</em> que lanzan consultas al servidor (comandos SQL). El servidor gestiona la capa de datos y devuelve los resultados a los clientes, que los analizan y los muestran por pantalla. Los ordenadores cliente contienen la l&oacute;gica de presentaci&oacute;n y la l&oacute;gica de negocio. Se denominan <em>clientes gruesos</em> (<em>fat clients</em> en ingl&eacute;s).</p>
<p>Esta arquitectura es m&aacute;s sencilla de escalar que la monol&iacute;tica, ya que el servidor est&aacute; especializado en la gesti&oacute;n de las bases de datos y es f&aacute;cilmente ampliable (muchos sistemas de gesti&oacute;n de BD tienen posibilidad de clustering y balanceo de carga).</p>
<p>Uno de los problemas fundamentales de este tipo de arquitectura es el mantenimiento y despliegue de las aplicaciones en los clientes. Cada vez que hay que realizar un cambio en la l&oacute;gica de negocio o de presentaci&oacute;n de la aplicaci&oacute;n hay que reinstalar todos los ordenadores clientes.</p>
<p>Al igual que en la aplicaci&oacute;n monol&iacute;tica, se trata de una arquitectura de muy dif&iacute;cil evoluci&oacute;n. Cada nuevo cambio (aunque sea a&ntilde;adir una peque&ntilde;a funcionalidad) obliga a recompilar y reinstalar toda la aplicaci&oacute;n.</p>
<p>La arquitectura centralizada (ahora en el lado del cliente) hace tambi&eacute;n muy dif&iacute;cil la comunicaci&oacute;n entre aplicaciones de distintas &aacute;reas de negocio de la empresa. Este problema se mejora con respecto la arquitectura monol&iacute;tica porque en la arquitectura cliente-servidor se suele utilizar la BD (y sus caracter&iacute;sticas de transaccionalidad y concurrencio) como elemento central de cohesi&oacute;n de m&uacute;ltiples apliaciones clientes.</p>
<a name="N10162"></a><a name="Aplicaciones+multi-capa%3A+3+o+m%C3%A1s+capas"></a>
<h3 class="underlined_5">Aplicaciones multi-capa: 3 o m&aacute;s capas</h3>
<p>

<img alt="" content-width="10cm" src="imagenes/apuntes01/arquitectura-tres-capas.png" width="500"> 
</p>
<p>En esta evoluci&oacute;n de la arquitectura de 2 capas, los clientes se hacen m&aacute;s <em>finos</em> (<em>thin client</em> en ingl&eacute;s) y se estandarizan con alg&uacute;n lenguaje (y aplicaci&oacute;n) de presentaci&oacute;n, como HTML (<em>browser</em>), Wap o aplicaci&oacute;n JME. Existen dos servidores, uno que gestiona la capa de datos y otro que genera la vista y se la env&iacute;a a los clientes. Las aplicaciones Web corresponden a esta arquitectura.</p>
<p>El hecho de separar la capa de datos de la capa de l&oacute;gica de negocio hace que la aplicaci&oacute;n sea m&aacute;s f&aacute;cil de ampliar y reusar. Otra ventaja de este tipo de aplicaciones es que no es necesario reinstalar los clientes cuando se modifica la aplciaci&oacute;n.</p>
<p>El &uacute;ltimo paso para hacer m&aacute;s distribuida y flexible la arquitectura es separar la generaci&oacute;n de la capa de presentaci&oacute;n de la l&oacute;gica de negocio. La siguiente figura muestra el resultado.</p>
<p>

<img alt="" content-width="12cm" src="imagenes/apuntes01/arquitectura-multicapa-3.png" width="700"> 
</p>
<p>Los distintos servidores que implementan la l&oacute;gica de negocio est&aacute;n especializados en distintas &aacute;reas de la empresa. Cada uno de ellos se puede gestionar de forma independiente. La comunicaci&oacute;n entre los servidores se realiza con est&aacute;ndares distribuidos como <em>servicios Web</em> o <em>componentes EJB</em>.</p>
<p>La ventaja principal de una arquitectura de este tipo es que, una vez en marcha, es muy escalable y muy flexible. Se hace muy sencillo a&ntilde;adir nuevas funcionalidades o modificar las ya existentes sin que el sistema tenga que sufrir cambios profundos. El principal inconveniente es la dificultad dise&ntilde;o y de puesta en marcha. </p>
</div>


<a name="N1019A"></a><a name="Tecnolog%C3%ADas+Java+EE"></a>
<h2 class="underlined_10">Tecnolog&iacute;as Java EE</h2>
<div class="section">
<p>La plataforma Java Enterprise Edition proporciona un amplio conjunto de APIs y servicios orientados a construir las arquitecturas presentadas en la secci&oacute;n anterior.</p>
<p>

<img alt="" content-width="7cm" src="imagenes/apuntes01/plataforma-javaee.png"> 
</p>
<p>Podemos diferenciar los siguientes elementos en la plataforma Java Enterprise:</p>
<ul>

<li>
<strong>IDEs</strong>: entornos de desarrollo, depuraci&oacute;n y programaci&oacute;n de aplicaciones enterprise. Los m&aacute;s populares son Eclipse y NetBeans. Al ser Java una tecnolog&iacute;a est&aacute;ndar, todos los entornos pueden compilar y ejecutar los programas desarrollados (aunque habr&iacute;a que adaptarlos a la estructura de <em>proyectos</em> definida en cada uno de ellos).</li>

<li>
<strong>Servidores</strong>: servidores Web y/o de aplicaciones que contienen los distintos objetos remotos propios de cada tecnolog&iacute;a (servlets, componentes EJB, servicios Web, etc.). Tambi&eacute;n se encargan de gestionar un conjunto de servicios de sistema, como son la seguridad, el acceso a <em>Data Sources</em> o a recursos JNDI, el clustering, etc.</li>

<li>
<strong>Librer&iacute;as de aplicaci&oacute;n</strong> (APIs): librer&iacute;as que implementan est&aacute;ndares definidos en la plataforma Java EE (gesti&oacute;n del correo, transacciones, mensajes, etc.)</li>

</ul>
<p>Muchos de estos elementos se basan en herramientas y APIs definidas en la plataforma Java SE, como RMI, JDBC o JNDI.</p>
<a name="N101C9"></a><a name="Capas+de+una+aplicaci%C3%B3n+enterprise"></a>
<h3 class="underlined_5">Capas de una aplicaci&oacute;n enterprise</h3>
<p>La plataforma Java Enterprise proporciona tecnolog&iacute;as para las distintas capas de un sistema distribuido. La siguiente figura muestra las tecnolog&iacute;as m&aacute;s importantes de cada capa.</p>
<p>

<img alt="" content-width="9cm" src="imagenes/apuntes01/plataforma-javaee-3.png"> 
</p>
<a name="N101DA"></a><a name="Capa+de+presentaci%C3%B3n"></a>
<h4>Capa de presentaci&oacute;n</h4>
<p>Existen dos grandes enfoques a la hora de definir la capa de presentaci&oacute;n en Java Enterprise. Uno es el de las aplicaciones Web, en las que la herramienta que realiza la presentaci&oacute;n es el navegador o <em>browser</em>. El segundo es el de las llamadas <em>aplicaciones de escritorio</em>, en el que una aplicaci&oacute;n Java (desarrollada en Java SE, utilizando Swing como API de interfaz de usuario) interact&uacute;a con el usuario y realiza las peticiones al servidor.</p>
<p>En el primer caso, la forma de comunicaci&oacute;n entre el cliente y el servidor son peticiones HTTP y p&aacute;ginas HTML. El usuario escribe una direcci&oacute;n en el navegador, o rellena un formulario en una p&aacute;gina HTML, o pincha en un enlace. El resultado de todas estas acciones es que el navegador construye una petici&oacute;n HTTP y la env&iacute;a al servidor. El servidor la recibe, la procesa (con alguna de las tecnolog&iacute;as que veremos adelante), construye una respuesta (una p&aacute;gina HTML) y la devuelve al navegador, que la muestra al usuario.</p>
<p>La segunda forma de gestionar la interacci&oacute;n con el usuario es mediante una aplicaci&oacute;n Java que se ejecuta en el cliente. Esta aplicaci&oacute;n implementa la interfaz de usuario utilizando alg&uacute;n API como Swing y se comunica con el servidor mediante una llamada a <em>componente EJB</em>, mediante una invocaci&oacute;n de un servicio Web o incluso mediante una petici&oacute;n HTTP. </p>
<p>La ventaja fundamental del primer enfoque es que la utilizaci&oacute;n de navegadores est&aacute;ndares evita la engorrosa tarea de la instalaci&oacute;n y el mantenimiento de aplicaciones clientes. La ventaja del segundo enfoque es que la interactividad que proporciona una aplicaci&oacute;n de escritorio desarrollada en Swing es mucho mayor que la que puede proporcionar una p&aacute;gina HTML en un navegador.</p>
<p>Una soluci&oacute;n intermedia que est&aacute; tomando cada vez m&aacute;s relevancia es la utilizaci&oacute;n de librer&iacute;as JavaScript (lenguaje est&aacute;ndar presente en todos los navegadores) para ejecutar peque&ntilde;as aplicaciones en las p&aacute;ginas HTML que realizan peticiones HTTP, reciben y parsean la respuesta y modifican din&aacute;micamente el propio HTML de la p&aacute;gina en la que residen. Es el famoso <em>AJAX</em>.</p>
<a name="N101FC"></a><a name="Capa+de+negocio"></a>
<h4>Capa de negocio</h4>
<p>La capa de negocio recibe una petici&oacute;n de un cliente, se realiza un proceso y se devuelve una respuesta. La plataforma Java Enterprise proporciona tambi&eacute;n bastantes posibilidades para implementar esta capa en el servidor.</p>
<ul>

<li>
<strong>Servlets y p&aacute;ginas JSP</strong>: residen en un <em>servidor Web</em>. Las peticiones se reciben en formato HTTP, el API de servlets las procesa y se construye la respuesta HTML utilizando plantillas JSP.</li>


<li>
<strong>JavaServer Faces</strong>: componentes que tambi&eacute;n residen en un servidor Web, procesan la petici&oacute;n HTTP y devuelven HTML. Es una tecnolog&iacute;a m&aacute;s elaborada que la de JSP y servlets (se construye sobre ellos) y proporciona facilidades para definir la navegaci&oacute;n entre p&aacute;ginas de la aplicaci&oacute;n, para convertir y validar datos en los formularios o para gestionar errores de la aplicaci&oacute;n. </li>


<li>
<strong>Componentes EJB</strong>: son objetos que residen en un servidor de aplicaciones (contenedor de EJB) y que proporcionan un conjunto de servicios (m&eacute;todos Java) que se ejecutan a petici&oacute;n de los clientes. Los par&aacute;metros que se pasan a estos m&eacute;todos y los valores devueltos a los clientes ya no son texto (peticiones HTTP), sino objetos Java serializados. El m&eacute;todo de conexi&oacute;n entre clientes y servidor es RMI.</li>


<li>
<strong>Servicios Web</strong>: est&aacute;n soportados tambi&eacute;n por servidores de aplicaciones y permiten la invocaci&oacute;n remota de servicios. A diferencia de los componentes EJB, los par&aacute;metros y los resultados vuelven a ser texto (en formato XML) y se realizan a trav&eacute;s de peticiones HTTP.</li>

</ul>
<a name="N10220"></a><a name="Capa+de+datos"></a>
<h4>Capa de datos</h4>
<p>La plataforma Java Enterprise proporciona el est&aacute;ndar JDBC para el acceso a bases de datos desde programas Java. Este API proporciona un interfaz de programaci&oacute;n completo para la gesti&oacute;n de bases de datos relacionales.</p>
<p>Tambi&eacute;n es posible definir una capa de <em>objetos persistentes</em> que abstraiga el uso de bases de datos relacionales utilizando el reciente JPA.</p>
<p>Java EE tambi&eacute;n proporciona la posibilidad de acceder a los datos en <em>aplicaciones heredadas</em> de la empresa mediante distintos <em>conectores</em> que permiten un acceso est&aacute;ndar a estos datos.</p>
<a name="N10239"></a><a name="Servicios+de+soporte"></a>
<h4>Servicios de soporte</h4>
<p>Adem&aacute;s de las capas anteriores, la plataforma Java Enterprise proporciona un conjunto de APIs para gestionar distintos servicios del sistema como seguridad, autentificaci&oacute;n, logeado, transacciones, etc:</p>
<ul>

<li>Java Message Service API (JMS)</li>

<li>JavaMail</li>

<li>Java Transaction API (JTA)</li>

<li>Java Authentication and Autorization Service (JAAS)</li>

</ul>
<a name="N10252"></a><a name="Arquitectura+de+aplicaciones+Java+Enterprise"></a>
<h4>Arquitectura de aplicaciones Java Enterprise</h4>
<p>Las tecnolog&iacute;as vistas en la secci&oacute;n anterior hacen posible configurar distints tipos de arquitecturas de aplicaciones Java EE. La siguiente figura muestra algunas de las posibles combinaciones. Los servicios Web son servidos a trav&eacute;s de servidores Web y estar&iacute;an incluidos en &eacute;stos. </p>
<p>

<img alt="" content-width="9cm" src="imagenes/apuntes01/plataforma-javaee-5.png"> 
</p>
<p>Enumeramos a continuaci&oacute;n las posibles conexiones y comentamos brevemente sus caracter&iacute;sticas: </p>
<ul>

<li>
<strong>Conexiones con un servidor Web</strong>: se realizan mediante peticiones HTTP. Estas peticiones son servidas por servlets (JSP o JSF) y pueden encapsular a su vez llamadas a servicios Web. El resultado de la petici&oacute;n es un mensaje en formato HTML o XML.</li>

<li>
<strong>Conexiones con un servidor EJB</strong>: se realizan mediante peticiones RMI a componentes EJB (beans de sesi&oacute;n -s&iacute;ncronos- o de mensajes -as&iacute;ncronos-).</li>

<li>
<strong>Conexiones con un servidor de base de datos</strong>: se realizan mediante JDBC o JPA.</li>

</ul>
<p>Es tarea del arquitecto Java el determinar qu&eacute; arquitectura es m&aacute;s conveniente para la aplicaci&oacute;n que se est&aacute; desarrollando. Cada soluci&oacute;n tiene sus ventajas y sus inconvenientes, y hay que ponderar &eacute;stos con las necesidades de la empresa y de la aplicaci&oacute;n.</p>
<a name="N1027D"></a><a name="Servidores+y+contenedores"></a>
<h3 class="underlined_5">Servidores y contenedores</h3>
<p>La plataforma Java EE especifica el funcionamiento de distintos tipos de contenedores: contenedores Web y contenedores EJB.</p>
<p>

<img alt="" content-width="9cm" src="imagenes/apuntes01/plataforma-javaee-4.png"> 
</p>
<p>Estos contenedores est&aacute;n incluidos en <em>servidores</em> que adem&aacute;s incorporan servicios a&ntilde;adidos (clustering, gesti&oacute;n de recursos, APIs, etc.). Son <em>servidores Web</em> y <em>servidores de aplicaciones</em>.</p>
<p>

<img alt="" content-width="8cm" src="imagenes/apuntes01/servidor-aplicaciones.png"> 
</p>
<p>Los servidores Web Java EE suelen ser plataformas gratuitas y de c&oacute;digo abierto (Tomcat, Resin, Jetty, [consultar una  <a href="http://java-source.net/open-source/web-servers">lista completa</a>]). Los servidores de aplicaciones suelen ser de pago (Bea Weblogic, IBM WebSphere, etc.), aunque se est&aacute;n popularizando versiones gratuitas (JBoss, Glassfish, [consultar una <a href="http://java-source.net/open-source/ejb-servers">lista completa</a> de servidores de aplicaciones de c&oacute;digo abierto]).</p>
</div>


<a name="N102AF"></a><a name="Enlaces+de+inter%C3%A9s"></a>
<h2 class="underlined_10">Enlaces de inter&eacute;s</h2>
<div class="section">
<p>El mundo de las tecnolog&iacute;as Java es muy amplio, muy activo y, sobre todo, abierto. Esto &uacute;ltimo es una ventaja muy importante. Una forma de introducirse en este mundo es estar al tanto de las noticias que se emiten en distintos canales RSS.</p>
<p>Una lista inicial de sitios y p&aacute;ginas de inter&eacute;s a los que estar conectado es el siguiente:</p>
<ul>

<li>
<a href="http://java.sun.com">Sun Java Developers</a>
</li>

<li>
<a href="http://java.sun.com/javaee/">Sun Java Developers (Zona Java EE)</a>
</li>

<li>
<a href="http://java.net/">Blogs de Sun sobre Java</a>
</li>

<li>
<a href="http://www.javahispano.org/">Java Hispano</a>
</li>

<li>
<a href="http://www.javalobby.org/">Java Lobby</a>
</li>

<li>
<a href="http://www.theserverside.com/">The Server Side</a>
</li>

</ul>
</div>


<p class="pageBreakAfter"></p>



</div>
<div class="clearboth">&nbsp;</div>
</div>
<div id="footer">
<div class="lastmodified">
<script type="text/javascript"><!--
document.write("<text>Last Published:</text> " + document.lastModified);
//  --></script>
</div>
<div class="copyright">
        Copyright &copy;
         2008-2009 Depto. CCIA</div>
</div>
</body>
</html>
