<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta http-equiv="Content-Language" content="es">
   <meta name="GENERATOR" content="Microsoft FrontPage 5.0">
   <meta name="ProgId" content="FrontPage.Editor.Document">
   <title>Pagina nueva 4</title>
   <style>
<!--
h1           { font-family: Tahoma; font-size: 18 pt; color: #808080; font-weight: bold }
h2           { font-family: Arial; color: #C0C0C0; font-size: 12 pt; font-weight: bold; 
               border-style: ridge }
h3           { font-family: Tahoma; color: #808080; font-size: 12 pt; font-weight: bold }
a            { color: #000000; text-decoration: underline; font-family: Arial; font-size: 
               10 pt }
a:hover      { color: #FFFFFF; background-color: #000000 }
body         { font-family: Arial; color: #000000; font-size: 10 pt }
-->
   </style>
</head>
<body bgcolor="#FFFFFF">

<b></b> 
<h1>Presentaci&oacute;n</h1>
Este curso comprende una buena parte de la programaci&oacute;n en Java.
Se tratan en &eacute;l temas desde la parte m&aacute;s b&aacute;sica (creaci&oacute;n
de las primeras clases, uso de hilos, excepciones, etc), hasta herramientas más 
complejas.
<p>Est&aacute; orientado a alumnos de inform&aacute;tica, que tengan alguna
noci&oacute;n b&aacute;sica de programaci&oacute;n orientada a objetos.
No es necesario, por lo tanto, tener conocimientos previos de Java, y con
el curso se pretende, partiendo desde lo m&aacute;s b&aacute;sico, llegar
a tareas avanzadas de la programaci&oacute;n con Java.
<p>Consta de <span lang="es">3</span>0 horas de clase, de contenido te&oacute;rico y pr&aacute;ctico, 
  y puede convalidarse por <b><span lang="es">3</span> cr&eacute;ditos de libre configuraci&oacute;n</b>. 
  Se suministrar&aacute; a los matriculados un CD con todos los materiales utilizados 
  en el curso y un cuaderno de apuntes del curso. 
<h1>
Temario</h1>
El curso se divide en <span lang="es">5</span> grandes temas, subdivididos a su vez en sesiones:
<p><b>Tema 1: Introducci&oacute;n a Java: </b>Conceptos b&aacute;sicos
sobre Java.
<blockquote><p><b> 1.1</b>: <b>Conceptos b&aacute;sicos de Java</b>:
  Conceptos sobre programaci&oacute;n orientada a objetos. Sintaxis y ejemplos
b&aacute;sicos de programas en Java.
  <p><b> 1.2</b>: <b> Java y entornos
de desarrollo</b>: Introducci&oacute;n a la filosof&iacute;a de Java. Algunas
herramientas de desarrollo que se pueden emplear para construir programas.</blockquote>

<p><br><b>Tema 2: Caracter&iacute;sticas b&aacute;sicas: </b>Algunos aspectos
b&aacute;sicos de la programaci&oacute;n en Java.
<blockquote>
  <p><b> 2.1</b>: <b>Excepciones y Reflection</b>: Uso de
excepciones en Java. API para la gestión de clases y objetos.</p>
  <p><b> 2.2</b>: <b> Hilos</b>: Multiprogramaci&oacute;n y manejo de hilos.</p>
  <p><b> 2.3</b>: <b>Tipos de Datos y </b><b>Entrada / Salida</b>: Tipos de
  datos útiles en Java. Lectura / escritura
de ficheros, flujos de entrada / salida.<p><b> 2.4</b>: <b>Red</b>:
  Acceso a URLs. Comunicaci&oacute;n
por sockets y datagramas. Aplicaciones cliente / servidor</blockquote>

<p><br><b>Tema 3: Interfaz gráfica: </b>Construcci&oacute;n de aplicaciones gr&aacute;ficas
con Java.
<blockquote>
  <p><b> 3.1</b>: <b>AWT</b>: Introducci&oacute;n a
AWT. Componentes. Eventos.</p>
<p><b> 3.2</b>: <b>Swing y Applets</b>: Introducci&oacute;n a Swing.
Applets<p><b> 3.3</b>: <b>Gráficos y animación</b>: Manejo de
  gráficos en Java. Animación</blockquote>

<p><b>Tema 4: Seguridad: </b>Restricciones de seguridad. Ficheros de pol&iacute;tica 
  de seguridad 
<p><b>Tema 5: Extensiones y ficheros JAR: </b>Ficheros JAR y extensiones de Java 
<h1>
Profesores</h1>
Domingo Gallardo L&oacute;pez
<br><a href="mailto:domingo@dccia.ua.es">domingo@dccia.ua.es</a>
<p>Miguel Angel Lozano Ortega
<br><a href="mailto:malozano@dccia.ua.es">malozano@dccia.ua.es</a>
<p>Ignacio Iborra Baeza
<br>
  <a href="mailto:iiborra@dccia.ua.es">iiborra@dccia.ua.es</a> <br>
  &nbsp;
<h1>
Matriculaci&oacute;n</h1>
Los interesados en este curso podr&aacute;n realizar una preinscripci&oacute;n 
al mismo, mediante el formulario de preinscripci&oacute;n que hay disponible. 
Una vez cerrado el plazo de preinscripci&oacute;n, se abrir&aacute; el plazo de 
matr&iacute;cula, donde se admitir&aacute; a los alumnos en el mismo orden en 
que se preinscribieron, hasta agotar las plazas disponibles. A los alumnos preinscritos 
se les avisar&aacute; por mail y mediante esta web sobre la matriculaci&oacute;n 
y sus plazos, una vez cerrada la preinscripci&oacute;n. 
<p>IMPORTANTE: el estar preinscrito no asegura que se disponga de plaza,
ni que &eacute;sta vaya a guardarse indefinidamente. S&oacute;lo supone
una reserva de plaza para luego confirmarla mediante el pago de la matr&iacute;cula.
Si expirado el plazo de pago el/la alumno/a no ha formalizado la matriculaci&oacute;n,
perder&aacute; su lugar en el orden de matriculaci&oacute;n, pasando a
ocuparlo el siguiente en la lista de espera.
<br>&nbsp;
</body>
</html>