<!-- saved from url=(0022)http://internet.e-mail -->
<!DOCTYPE html PUBLIC "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
                
  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
                
  <meta http-equiv="Content-Language" content="es">
                
  <meta name="GENERATOR" content="Microsoft FrontPage 5.0">
                
  <meta name="ProgId" content="FrontPage.Editor.Document">
  <title>Pagina nueva 4</title>
                             
  <style>
<!--
h1           { font-family: Tahoma; font-size: 18 pt; color: #808080; font-weight: bold }
h2           { font-family: Arial; color: #C0C0C0; font-size: 12 pt; font-weight: bold; 
               border-style: ridge }
h3           { font-family: Tahoma; color: #CC0000; font-size: 10 pt; font-weight: bold }
a            { color: #000000; text-decoration: underline; font-family: Arial; font-size: 
               10 pt }
a:hover      { color: #FFFFFF; background-color: #000000 }
body         { font-family: Arial; color: #000000; font-size: 10 pt }
-->
  </style>
</head>
 <body bgcolor="#ffffff">
<h1>Noticias</h1>

<h3>Lunes<b> <span lang="es">28</span>/7/2003</b></h3>
<blockquote> 
  <p>A partir del pr&oacute;ximo mes de Octubre se impartir&aacute; un curso de 
    especialista universitario en <a href="http://www.dccia.ua.es/j2ee" target="_blank">Aplicaciones 
    y Servicios Web con Java Enterprise</a> (J2EE). En la p&aacute;gina web del 
    curso se puede encontrar informaci&oacute;n detallada, as&iacute; como una 
    lista de correo en la que pueden apuntarse los interesados en matricularse.</p>
  <p>Se he creado un <a href="http://www.dccia.ua.es/dccia/inf/asignaturas/PAJ/indice/index.htm" target="_blank">&iacute;ndice</a> 
    para acceder a todos los cursos sobre tecnolog&iacute;as Java ofertados por 
    el departamento. </p>
</blockquote>
<h3>Viernes<b> <span lang="es">25</span>/7/2003</b></h3>
<blockquote> 
  <p>En Septiembre se impartir&aacute; un curso sobre Programaci&oacute;n de Dispositivos 
    M&oacute;viles Java utilizando J2ME. Los interesados pod&eacute;is preinscribiros 
    y obtener m&aacute;s informaci&oacute;n en la web del curso:</p>
  <blockquote> 
    <p><a href="http://www.dccia.ua.es/dccia/inf/asignaturas/PDM" target="_blank">http://www.dccia.ua.es/dccia/inf/asignaturas/PDM/</a></p>
  </blockquote>
</blockquote>
<h3>Martes<b> <span lang="es">15</span>/7/2003</b></h3>
<blockquote> 
  <p>&Uacute;ltimas plazas disponibles para el segundo grupo (del 23 al 30 de 
    Julio). Los interesados en realizar el curso pod&eacute;is matricularos acudiendo 
    a la secretar&iacute;a del Dpto. de Ciencia de la Computaci&oacute;n e Inteligencia 
    Artificial. No es necesario haberse preinscrito previamente.</p>
</blockquote>
<h3>Jueves<b> <span lang="es">10</span>/7/2003</b></h3>
<blockquote> 
  <p>El laboratorio en el que se impartir&aacute; la CUARTA EDICI&Oacute;N del 
    curso ser&aacute; el <strong>L24</strong>, situado en el edificio Polit&eacute;cnica 
    1.</p>
</blockquote>
<h3>Lunes<b> <span lang="es">30</span>/<span lang="es">6</span>/2003</b></h3>
<blockquote> 
  <p>Abierto el plazo de matr&iacute;cula para la CUARTA EDICI&Oacute;N del curso. 
    Habr&aacute; dos grupos: el primero del 15 al 22 de Julio y el segundo del 
    23 al 30 de Julio, ambos con el horario de 16:00 a 21:00. <b>La elecci&oacute;n 
    del grupo se har&aacute; seg&uacute;n el orden de matr&iacute;cula</b>. Se 
    notificar&aacute; por correo electr&oacute;nico los alumnos que est&aacute;n 
    preinscritos y pueden matricularse y los que quedan en lista de espera. Despu&eacute;s 
    del 8 de Julio se abrir&aacute; un segundo plazo de matr&iacute;cula (si queda 
    alguna plaza vacante) para la lista de espera.</p>
  <ul>
    <li>Fechas de matr&iacute;cula: <span lang="es"><b>del 1 al 8 de Julio</b></span></li>
  </ul>
</blockquote>
<h3><span lang="es">Martes</span><b> <span lang="es">3</span>/<span lang="es">6</span>/2003</b></h3>
<blockquote> 
  <p>Abierto el plazo de preinscripción para la <span lang="es"><b>CUARTA</b></span><b> 
  EDICIÓN</b> del curso. </p>
  <ul>
    <li>Fechas: <span lang="es">Días</span> <strong>1<span lang="es">5, 16, 17, 
    18, 21 y 22 
    de Julio </span>de 2003 (provisional)</strong></li>
    <li>Horario:  de <strong>1<span lang="es">6</span>:00 a 21:00 horas (provisional)</strong></li>
    <li>Precio: <strong>1<span lang="es">08</span></strong></li>
    <li>Convalidable por <strong><span lang="es">3</span> cr&eacute;ditos</strong> de libre elecci&oacute;n</li>
  </ul>
</blockquote>

<h3><b>Jueves 30/1/2003</b></h3>
<blockquote> 
  <p>Cerrado el plazo de matriculaci&oacute;n en la <strong>TERCERA EDICI&Oacute;N</strong> 
    del curso. </p>
</blockquote>
<h3><b>Viernes 24/1/2003</b></h3>
<blockquote> 
  <p>Todos los que est&eacute;is preinscritos en lista de espera pod&eacute;is 
    pasar a realizar la matriculaci&oacute;n durante la semana del 27 al 31 de 
    enero para cubrir las plazas que han quedado vacantes. No se garantiza la 
    disponibilidad de plazas, ya que la lista de espera es mayor que el n&uacute;mero 
    de plazas vacantes. El orden de preferencia para obtener las plazas ser&aacute; 
    el orden en el que acud&aacute;is a matricularos.</p>
  <p>Para realizar la matr&iacute;cula deber&eacute;is entregar el siguiente impreso 
    cumplimentado en la secretar&iacute;a del departamento durante la semana del 
    27 al 31 de enero:</p>
  <blockquote>
    <p><a href="../impreso_matricula_paj.pdf">Impreso de matr&iacute;cula</a></p>
  </blockquote>
</blockquote>
<h3><b>Viernes 24/1/2003</b></h3>
<blockquote> 
  <p>Cerrado el plazo de preinscripci&oacute;n.</p>
</blockquote>
<h3><b>Viernes 17/1/2003</b></h3>
<blockquote> 
  <p>La matriculaci&oacute;n para los primeros preinscritos se realizar&aacute; 
    durante la semana del 20 al 24 de Enero. Los que os encontr&eacute;is entre 
    estos primeros preinscritos habr&eacute;is recibido un correo, en la direcci&oacute;n 
    que especificasteis en la preinscripci&oacute;n, indicando el procedimiento 
    de la matr&iacute;cula.</p>
</blockquote>
<h3><b>Viernes 10/1/2003</b></h3>
<blockquote> 
  <p>Abierto el plazo de preinscripción para la <b>TERCERA EDICIÓN</b> del curso. 
    Esta nueva edición se ha ampliado a 4 cr&eacute;ditos, y se impartir&aacute; 
    a lo largo del segundo cuatrimestre:</p>
  <ul>
    <li>Fechas: Desde el <strong>14 de Febrero hasta el 30 de Mayo de 2003 (provisional)</strong></li>
    <li>Horario: Viernes de <strong>18:00 a 21:00 horas (provisional)</strong></li>
    <li>Aula: Laboratorio <strong>L17 (provisional)</strong></li>
    <li>Precio: <strong>144&euro;</strong></li>
    <li>Convalidable por <strong>4 cr&eacute;ditos</strong> de libre elecci&oacute;n</li>
  </ul>
</blockquote>
<h3><b>Jueves 17/10/2002</b></h3>
<blockquote> 
  <p>Ya est&aacute;n disponibles los diplomas para los que realizast&eacute;is 
    la segunda edici&oacute;n del curso. Pod&eacute;is pasar a recogerlos a partir 
    de este momento por el despacho de Miguel Angel Lozano<em></em>.</p>
</blockquote>
<h3><b>Jueves 17/10/2002</b></h3>
<blockquote> 
  <p>Se ha incluido una versi&oacute;n imprimible de los apuntes del curso, en 
    formato PDF. Se trata de la revisi&oacute;n del 15/10/2002, en la que se han 
    corregido y actualizado los apuntes del curso. Puedes bajartela desde la p&aacute;gina 
    se <em>sesiones</em>.</p>
  </blockquote>
<h3><b>Viernes 20/09/2002</b></h3>
<blockquote> 
  <p>Las clases para la <b>SEGUNDA EDICIÓN</b> del curso comenzar&aacute;n el 
    pr&oacute;ximo lunes 23 de Septiembre, en el laboratorio <b>L17</b>. Los horarios 
    para cada grupo son los siguientes:</p>
  <ul>
    <li>Grupo ma&ntilde;ana: D&iacute;as 23, 24, 25, 26, 27 y 28 de Septiembre, 
      de 9:00 a 14:00 horas. </li>
    <li>Grupo tarde: D&iacute;as 23, 24, 25, 26, 27 y 30 de Septiembre, de 16:00 
      a 21:00 horas</li>
  </ul>
</blockquote>
<h3><b>Jueves 19/09/2002</b></h3>
<blockquote> 
  <p>Actualizados los apuntes de la p&aacute;gina. Se han a&ntilde;adido nuevos 
    temas (reflection, tipos de datos, gr&aacute;ficos) y se han ampliado algunos 
    de los anteriores como JDBC. Se han a&ntilde;adido como recursos todas las 
    extensiones oficiales de Sun de J2SE, en sus versiones Windows y Linux, siempre 
    que est&eacute;n disponibles, as&iacute; como la documentaci&oacute;n oficial 
    disponible sobre ellas, y m&aacute;s material adicional. Todo este contenido 
    estar&aacute; disponible en el CD que entregaremos pr&oacute;ximamente, tanto 
    a los alumnos de la primera edici&oacute;n como a los de la segunda.</p>
</blockquote>
<h3><b>Lunes 16/09/2002</b></h3>
<blockquote> 
  <p>Cerrado el plazo de preinscripci&oacute;n de la segunda edici&oacute;n del 
    curso.</p>
</blockquote>
<h3><b>Martes 3/09/2002</b></h3>
<blockquote>
  <p>Abierto el plazo de preinscripción para la <b>SEGUNDA EDICIÓN</b> del curso. Esta nueva
edición se impartirá los días 23, 24, 25, 26, 27 y 30 de Septiembre, de 16:00 a 21:00
horas.</p>
  </blockquote>

<h3><b>Viernes 5/07/2002</b></h3>
<blockquote>
  <p>El laboratorio en el que se impartir&aacute; el curso ser&aacute; el
  <b>L27</b>. Recordamos que el primer grupo comenzar&aacute; el lunes 15
de Julio a  las 16:00 en dicho laboratorio, y el segundo el martes 23 de
Julio a las 16:00 en el mismo laboratorio. Se os enviar&aacute; un e-mail
recordatorio a los matriculados en cada grupo.</p>
  </blockquote>
  <h3><b>Jueves 16/05/2002</b></h3>
  <blockquote>
    <p>Debido al gran n&uacute;mero de solicitudes de preinscripci&oacute;n
en el curso,  se har&aacute;n dos grupos, cada uno de ellos de 25 plazas.
Las fechas en las que  se impartir&aacute; el curso para cada grupo son las
siguientes:</p>
    <ul>
      <li>Grupo 1: D&iacute;as 15, 16, 17, 18, 19 y 22 de Julio, de 16:00
a 21:00  horas. </li>
      <li>Grupo 2: D&iacute;as 23, 24, 25, 26, 29 y 30 de Julio, de 16:00
a 21:00  horas.</li>
    </ul>
    <p>Se han realizado un total de 98 preinscripciones, habiendo &uacute;nicamente 
 50   plazas disponibles, por lo que las 50 primeras solicitudes ser&aacute;n
admitidas  y las restantes pasar&aacute;n a la lista de espera. Cada alumno
preinscrito recibir&aacute;  en   su direcci&oacute;n de correo un mensaje
notificandole si ha sido admitido o si por el contrario est&aacute; en lista
de espera.<br>
    <br>
      La matricula para los 50 primeros admitidos se deber&aacute; realizar
durante  la semana del 20 al 24 de Mayo. Informaremos mediante correo electr&oacute;nico 
del procedimiento que se debe seguir para realizar la matr&iacute;cula a
estos primeros  admitidos.<br>
    <br>
      Una vez transcurrida la primera semana de matriculaci&oacute;n, aquellos
admitidos  iniciales que no hayan formalizado la matr&iacute;cula perder&aacute;n
el derecho a la misma, otorgando dichas plazas a los siguientes en la lista
de espera. En este momento informaremos mediante correo electr&oacute;nico
a la gente que est&eacute; en lista de espera y que pueda obtener una plaza,
para que realicen la matr&iacute;cula durante la semana siguiente.</p>
    </blockquote>
    <h3><b>Viernes 10/05/2002</b></h3>
    <blockquote>
      <p>Cerrado el plazo de preinscripci&oacute;n.</p>
      </blockquote>
      <h3><b>Lunes 06/05/2002</b></h3>
      <blockquote>
        <p>Abierto el plazo de preinscripci&oacute;n.</p>
        </blockquote>
        </body>
        </html>